/*********************************************************************************************************
 * Copyright (c) 2011,深圳科陆电子科技股份有限公司
 * All rights reserved.
 *
 * 文件名称：MeterAPIEx.cpp
 * 摘    要：本文件主要实现抄表接口需要根据不同协议修改的部分
 * 当前版本：1.0
 * 作    者：
 * 完成日期：2011年3月
 *********************************************************************************************************/
#include "FaAPI.h"
#include "DbAPI.h"
#include "MtrAPI.h"

#define BANK0_TO_645ID_MAX	16
const WORD g_wBank0To645ID[][BANK0_TO_645ID_MAX] =		//国标BANK0内部ID到645ID的映射
{
	/*{0x112f, 0xb63f, 0xb64f, 0xb65f, 0xb61f, 0xb62f, 0}, //当前三相及总有/无功功率、功率因数，三相电压、电流、零序电流
	{0x113f, 0xb31f, 0xb32f, 0xb33f, 0xb34f, 0},		 //A、B、C三相断相统计数据及最近一次断相记录
	{0x114f, 0xc011, 0xc010, 0xc020, 0xc021, 0xb210, 0xb211, 0xb212, 0xb213, 0xb214, 0}, //电能表日历时钟及电能表状态信息
	{0x115f, 0x901f, 0x911f, 0x913f, 0x914f, 0}, //当前正向有/无功电能示值、一/四象限无功电能示值（总、费率1~M）	
	{0x116f, 0x902f, 0x912f, 0x915f, 0x916f, 0}, //当前反向有/无功电能示值、二/三象限无功电能示值（总、费率1~M）
	{0x117f, 0xa01f, 0xb01f, 0xa11f, 0xb11f, 0}, //当月正向有/无功最大需量及发生时间（总、费率1~M）
	{0x118f, 0xa02f, 0xb02f, 0xa12f, 0xb12f, 0}, //当月反向有/无功最大需量及发生时间（总、费率1~M）
	{0x119f, 0x941f, 0x951f, 0x953f, 0x954f, 0}, //上月正向有/无功电能示值、一/四象限无功电能示值（总、费率1~M）
	{0x11af, 0x942f, 0x952f, 0x955f, 0x956f, 0}, //上月反向有/无功电能示值、二/三象限无功电能示值（总、费率1~M）
	{0x11bf, 0xa41f, 0xb41f, 0xa51f, 0xb51f, 0}, //上月正向有/无功最大需量及发生时间（总、费率1~M）
	{0x11cf, 0xa42f, 0xb42f, 0xa52f, 0xb52f, 0}, //上月反向有/无功最大需量及发生时间（总、费率1~M）
	{0x126f, 0xb66f, 0}, //相位角*/
	
	{0x166f, 0x901f, 0}, 
	{0x167f, 0x911f, 0}, 
	{0x168f, 0x902f, 0}, 
	{0x169f, 0x912f, 0}, 
	{0x16af, 0x913f, 0},
	{0x16bf, 0x915f, 0},
	{0x16cf, 0x916f, 0},
	{0x16df, 0x914f, 0},

	{0x2011, 0x2011, 0}, //AB线电压
	{0x2012, 0x2012, 0}, //BC线电压
	{0x2013, 0x2013, 0}, //CA线电压
	{0x2014, 0x2014, 0}, //A/AB相基波电压
	{0x2015, 0x2015, 0}, //B相基波电压
	{0x2016, 0x2016, 0}, //C/CA相基波电压
	{0x2021, 0x2021, 0}, //A相基波电流
	{0x2022, 0x2022, 0}, //B相基波电流
	{0x2023, 0x2023, 0}, //C相基波电流

	{0x20cf, 0xa01f, 0xb01f, 0}, //正有
	{0x20df, 0xa02f, 0xb02f, 0}, //反有
	{0x20ef, 0xa11f, 0xb11f, 0}, //正无
	{0x210f, 0xa12f, 0xb12f, 0}, //反无

	{0x3761, 0x9a1f, 0}, //日冻结正向有功电能示值（总、费率1~M）	
	{0x3762, 0x9b1f, 0}, //日冻结正向无功电能示值（总、费率1~M）	
	{0x3763, 0x9a2f, 0}, //日冻结反向有功电能示值（总、费率1~M）	
	{0x3764, 0x9b2f, 0}, //日冻结方向无功电能示值（总、费率1~M）	
	{0x3765, 0x9b3f, 0}, //日冻结一象限无功电能示值（总、费率1~M）	
	{0x3766, 0x9b5f, 0}, //日冻结二象限无功电能示值（总、费率1~M）	
	{0x3767, 0x9b6f, 0}, //日冻结三象限无功电能示值（总、费率1~M）	
	{0x3768, 0x9b4f, 0}, //日冻结四象限无功电能示值（总、费率1~M）


	{0x3777, 0x9a1f, 0}, //月冻结正向有功电能示值（总、费率1~M）	
	{0x3778, 0x9b1f, 0}, //月冻结正向无功电能示值（总、费率1~M）	
	{0x3779, 0x9a2f, 0}, //月冻结反向有功电能示值（总、费率1~M）	
	{0x3780, 0x9b2f, 0}, //月冻结方向无功电能示值（总、费率1~M）	
	{0x3781, 0x9b3f, 0}, //月冻结一象限无功电能示值（总、费率1~M）	
	{0x3782, 0x9b5f, 0}, //月冻结二象限无功电能示值（总、费率1~M）	
	{0x3783, 0x9b6f, 0}, //月冻结三象限无功电能示值（总、费率1~M）	
	{0x3784, 0x9b4f, 0}, //月冻结四象限无功电能示值（总、费率1~M）

	{0x3785, 0x9c0f, 0x9c8f, 0}, //日冻结正向有功最大需量及发生时间（总、费率1~M）
	{0x3786, 0xa11f, 0xb11f, 0}, //日冻结正向无功最大需量及发生时间（总、费率1~M）
	{0x3787, 0x9c2f, 0x9caf, 0}, //日冻结反向有功最大需量及发生时间（总、费率1~M）
	{0x3788, 0xa12f, 0xb12f, 0}, //日冻结反向无功最大需量及发生时间（总、费率1~M）
	{0x3789, 0xa41f, 0xb41f, 0}, //抄表日冻结正向有功最大需量及发生时间（总、费率1~M）
	{0x3790, 0xa51f, 0xb51f, 0}, //抄表日冻结正向无功最大需量及发生时间（总、费率1~M）
	{0x3791, 0xa42f, 0xb42f, 0}, //抄表日冻结反向有功最大需量及发生时间（总、费率1~M）
	{0x3792, 0xa52f, 0xb52f, 0}, //抄表日冻结反向无功最大需量及发生时间（总、费率1~M）	
	{0x3793, 0x9c0f, 0x9c8f, 0}, //月冻结正向有功最大需量及发生时间（总、费率1~M）
	{0x3794, 0xa11f, 0xb11f, 0}, //月冻结正向无功最大需量及发生时间（总、费率1~M）
	{0x3795, 0x9c2f, 0x9caf, 0}, //月冻结反向有功最大需量及发生时间（总、费率1~M）
	{0x3796, 0xa12f, 0xb12f, 0}, //月冻结反向无功最大需量及发生时间（总、费率1~M）

	//为了让曲线的特别抄表ID能顺利下来抄表
	{0x3681, 0x3681, 0},
	{0x3682, 0x3681, 0},
	{0x3683, 0x3681, 0},
	{0x3684, 0x3681, 0},
	{0x3685, 0x3681, 0},
	{0x3686, 0x3681, 0},
	{0x3687, 0x3681, 0},
	{0x3688, 0x3681, 0},
	{0x3689, 0x3689, 0},
	{0x3690, 0x3689, 0},
	{0x3691, 0x3689, 0},
	{0x3692, 0x3689, 0},
	{0x3693, 0x3689, 0},
	{0x3694, 0x3689, 0},
	{0x3701, 0x3701, 0},
	{0x3702, 0x3701, 0},
	{0x3703, 0x3701, 0},
	{0x3704, 0x3701, 0},
	{0x3705, 0x3705, 0},
	{0x3706, 0x3705, 0},
	{0x3707, 0x3705, 0},
	{0x3708, 0x3705, 0},
	{0x3745, 0x3745, 0},
	{0x3746, 0x3745, 0},
	{0x3747, 0x3745, 0},
	{0x3748, 0x3745, 0},

	//月冻结取结算日数据
	{0x3877, 0x941f, 0},	//结算日正向有功
	{0x3878, 0x951f, 0},	//结算日正向无功 
	{0x3879, 0x942f, 0},	//结算日反向有功
	{0x3880, 0x952f, 0},	//结算日反向无功
	{0x3881, 0x953f, 0},	//结算日一象限无功
	{0x3882, 0x955f, 0},	//结算日二象限无功
	{0x3883, 0x956f, 0},	//结算日三象限无功
	{0x3884, 0x954f, 0},	//结算日四象限无功

	{0x8e70, 0xb6a0, 0}, //零序电流
	
	{0x9000, 0x900f, 0}, //组合有功电能块
	{0x9001, 0x900f, 0}, //组合有功电能块
	{0x9002, 0x900f, 0}, //组合有功电能块
	{0x9003, 0x900f, 0}, //组合有功电能块
	{0x9004, 0x900f, 0}, //组合有功电能块
	{0x900f, 0x900f, 0}, //组合有功电能块
	
	{0},
};

const WORD* Bank0To645ID(WORD wID)
{
	WORD i;
	WORD wNum = sizeof(g_wBank0To645ID) / (sizeof(WORD)*BANK0_TO_645ID_MAX);	
	for (i=0; i<wNum; i++)
	{
		if (wID == g_wBank0To645ID[i][0])
		{
			return &g_wBank0To645ID[i][1];
		}
	}

	return NULL;
}


//描述:判断一个BANK0的wID是否是需要抄表的ID
bool IsMtrID(WORD wID)
{
	if (wID >= 0x9010) //645ID
		return true;
	else if (Bank0To645ID(wID) != NULL)	//BANK0的非645ID组合ID
		return true;
	else
		return false;
}


//描述：是否曲线冻结ID
bool IsCurveId(WORD wID)
{
	if ( wID>=0x3681 && wID<=0x3694
		|| wID>=0x3701 && wID<=0x3708
		|| wID>=0x3745 && wID<=0x3748)
		return true;
	else
		return false;
}

//描述：是否日冻结ID
bool IsDayFrzId(WORD wID)		
{
	if ((wID>>8)==0x9a || (wID>>8)==0x9b
		|| (wID>>8)==0x9c)
		return true;
	else
		return false;
}

