/*********************************************************************************************************
 * Copyright (c) 2011,深圳科陆电子科技股份有限公司
 * All rights reserved.
 *
 * 文件名称：MtrCfg.c
 * 摘    要：电表抄读的配置文件,主要用来配置每个数据项在什么情况下抄读
 * 当前版本：1.0
 * 作    者：
 * 完成日期：2011年1月
 *********************************************************************************************************/
#include "MtrStruct.h"
#include "ComConst.h"

//备注：
//1.控制标志位,对于国标来说dwFnFlg[]的每个元素与bFn[]一一对应，分别控制每个FN在什么情况下进行抄读
//2.对于日月冻结，07表可以完全按照抄当前/抄表冻结的配置来执行；对于97表来说，抄表冻结不执行，抄当前都执行。
//3.对于抄表日冻结，我们认为97表的上月冻结和07表的上一结算日冻结就是抄表日冻结，所以07和97表都按照抄当前/抄表冻结的配置来执行
//4.控制标志位dwC2Flg尽量配置成单三相都支持，到底要不要抄让测量点特征字bC2Fn配置的FN去选择
//  对于重点户，由于重点户的配置不分大小类，也可以用dwCtlFlg区分单三相
//5.对于抄当前和抄电表冻结都要抄的数据项，不要配置抄当前或者抄电表标志，就可以让它在两种情况下都能抄读，比如：
//	2类的以下数据项的控制标志位DEMDMCUR去掉，让他们不管在配置成抄当前或者抄电表冻结的时候都去抄，因为电表没有这些ID的日冻结数据项
//  对于F3,F19,F186,F194：	0xa11f,  //当前正向无功最大需量（总、费率1~M）
//						  	0xb11f  //当前正向无功最大需量发生时间（总、费率1~M）	
//	对于F4, F20, F188, F196 0xa12f,  //当前反向无功最大需量（总、费率1~M）
//							0xb12f,  //当前反向无功最大需量发生时间（总、费率1~M）

//集抄抄读控制结构
static const TMtrRdCtrl g_MtrRdCtrl[] = {	
	//wID, 		bIntervU,  	bIntervV wIntervID  年   月  日  时  分  秒    	Fn 							FnFlg

	//=====================================================================================================
	//--------------------------曲线冻结配置成抄电表实时数据项---------------------------------------------
    {0x911f,  TIME_UNIT_HOUR,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 24},    {1, M07|PH3|PFCUR}},  //示值曲线
	{0x902f,  TIME_UNIT_HOUR,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 25},    {1, M07|PH13|PFCUR}},  //示值曲线
	{0x912f,  TIME_UNIT_HOUR,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 26},    {1, M07|PH3|PFCUR}},  //示值曲线
	{0xb61f,  TIME_UNIT_HOUR,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 27},	{1, M07|PH3|PFCUR}},	//电压
	{0xb62f,  TIME_UNIT_HOUR,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 28},	{1, M07|PH3|PFCUR}},	//电流
	{0xb65f,  TIME_UNIT_HOUR,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 29},	{1, M07|PH3|PFCUR}},	//功率因素
    {0x901f,  TIME_UNIT_HOUR,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 23},    {1, M07|PH13|PFCUR}},  //示值曲线		//在台体上晚点抄
	//=====================================================================================================
	//--------------------------日冻结配置成抄电表冻结数据项---------------------------------------------
	{0x9a00,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  5,  0},	{1,ALLPN},	{1, M07|PH13|DMMTR}},	//上次日冻结时间
	{0x9a1f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  5,  0},	{1, 1},		{1, M07|PH13|DMMTR}},	//日冻结, 正向有功电能示值(总、费率1~M)	
	{0x9a2f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  5,  0},	{1, 3},		{1, M07|PH13|DMMTR}},  //日冻结, 反向有功电能示值（总、费率1~M）
	{0x9b1f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 2},		{1, M07|PH3|DMMTR}},  //日冻结, 正向无功电能示值（总、费率1~M）
	{0x9b2f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 4},		{1, M07|PH3|DMMTR}},  //日冻结, 反向无功电能示值（总、费率1~M）
	{0x9b3f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  5,  0},   	{1, 5},    	{1, M07|PH3|DMMTR}},  //日冻结, 一象限无功电能示值（总、费率1~M）
	{0x9b5f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  5,  0},   	{1, 6},    	{1, M07|PH3|DMMTR}},  //日冻结, 二象限无功电能示值（总、费率1~M）
	{0x9b6f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 7},    	{1, M07|PH3|DMMTR}},  //日冻结, 三象限无功电能示值（总、费率1~M）
	{0x9b4f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 8},		{1, M07|PH3|DMMTR}},  //日冻结, 四象限无功电能示值（总、费率1~M）

	{0xc86f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 9},		{1, M0797|PH13|DMMTR}},	//电表状态字数据块

	//=====================================================================================================
	//--------------------------月冻结配置成抄电表冻结数据项---------------------------------------------
	{0x9a00,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},	{1,ALLPN},		{1, M07|PH13|DMMTR}},	//上次日冻结时间
	{0x9a1f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},	{1, 13},		{1, M07|PH13|DMMTR}},	//月冻结, 正向有功电能示值(总、费率1~M)	
	{0x9a2f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},	{1, 15},		{1, M07|PH13|DMMTR}},  //月冻结, 反向有功电能示值（总、费率1~M）
	{0x9b1f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 14},		{1, M07|PH3|DMMTR}},  //月冻结, 正向无功电能示值（总、费率1~M）
	{0x9b2f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 16},		{1, M07|PH3|DMMTR}},  //月冻结, 反向无功电能示值（总、费率1~M）
	{0x9b3f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},   	{1, 17},    	{1, M07|PH3|DMMTR}},  //月冻结, 一象限无功电能示值（总、费率1~M）
	{0x9b5f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},   	{1, 18},    	{1, M07|PH3|DMMTR}},  //月冻结, 二象限无功电能示值（总、费率1~M）
	{0x9b6f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 19},    	{1, M07|PH3|DMMTR}},  //月冻结, 三象限无功电能示值（总、费率1~M）
	{0x9b4f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 20},		{1, M07|PH3|DMMTR}},  //月冻结, 四象限无功电能示值（总、费率1~M）

	//月冻结需量ID,对于07表协议,同时包括需量及需量时间,
	{0x9a00,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},	{1,ALLPN},		{1, M07|PH13|DEMDMMTR}},	//上次日冻结时间
	{0x9c0f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 11},		{1, M07|PH3|DEMDMMTR}}, //月冻结, 正向有功最大需量及发生时间（总、费率1~M）
	{0x9c2f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 12},		{1, M07|PH3|DEMDMMTR}}, //月冻结, 反向有功最大需量及发生时间（总、费率1~M）
	{0x9c8f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 11},		{1, M07|PH3|DEMDMMTR}}, //月冻结, 正向有功最大需量及发生时间（总、费率1~M）
	{0x9caf,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 12},		{1, M07|PH3|DEMDMMTR}}, //月冻结, 反向有功最大需量及发生时间（总、费率1~M）

	{0x2200,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 21},		{1, M07|PH3|DMMTR}}, //月电压越限统计

	//=====================================================================================================
	//--------------------------日冻结配置成抄当前数据项-------------------------------------------------
	//当前正向有/无功电能示值、一/四象限无功电能示值（总、费率1~M）	{0x115f, 0x901f, 0x911f, 0x913f, 0x914f, 0},
	{0x901f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 1},  		{1, M0797|PH13|DMCUR}},	//当前正向有功电能示值（总、费率1~M）
	{0x911f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 2},  		{1, M0797|PH3|DMCUR}},	//当前正向无功电能示值（总、费率1~M）
	{0x913f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 5},  		{1, M0797|PH3|DMCUR}},	//当前一象限无功电能示值（总、费率1~M）
	{0x914f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 8},  		{1, M0797|PH3|DMCUR}},	//当前四象限无功电能示值（总、费率1~M）

	//当前反向有/无功电能示值、二/三象限无功电能示值（总、费率1~M）{0x116f, 0x902f, 0x912f, 0x915f, 0x916f, 0}, 
	{0x902f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 3},			{1,  M0797|PH13|DMCUR}},	//当前反向有功电能示值（总、费率1~M）
	{0x912f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 4},			{1, M0797|PH3|DMCUR}},	//当前反向无功电能示值（总、费率1~M）
	{0x915f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 6},			{1, M0797|PH3|DMCUR}},	//当前二象限无功电能示值（总、费率1~M）
	{0x916f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 7},			{1, M0797|PH3|DMCUR}},	//当前三象限无功电能示值（总、费率1~M）

	{0xc86f,  TIME_UNIT_DAY,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 9},			{1, M0797|PH13|DMCUR}},	//电表状态字数据块

	//=====================================================================================================
	//--------------------------月冻结配置成抄当前数据项-------------------------------------------------
	//当前正向有/无功电能示值、一/四象限无功电能示值（总、费率1~M）	{0x115f, 0x901f, 0x911f, 0x913f, 0x914f, 0},
	{0x901f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 13},  		{1, M0797|PH13|DMCUR}},	//当前正向有功电能示值（总、费率1~M）
	{0x911f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 14},  		{1, M0797|PH3|DMCUR}},	//当前正向无功电能示值（总、费率1~M）
	{0x913f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 17},  		{1, M0797|PH3|DMCUR}},	//当前一象限无功电能示值（总、费率1~M）
	{0x914f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 20},  		{1, M0797|PH3|DMCUR}},	//当前四象限无功电能示值（总、费率1~M）

	//当前反向有/无功电能示值、二/三象限无功电能示值（总、费率1~M）{0x116f, 0x902f, 0x912f, 0x915f, 0x916f, 0}, 
	{0x902f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 15},			{1, M0797|PH13|DMCUR}},	//当前反向有功电能示值（总、费率1~M）
	{0x912f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 16},			{1, M0797|PH3|DMCUR}},	//当前反向无功电能示值（总、费率1~M）
	{0x915f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 18},			{1, M0797|PH3|DMCUR}},	//当前二象限无功电能示值（总、费率1~M）
	{0x916f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 19},			{1, M0797|PH3|DMCUR}},	//当前三象限无功电能示值（总、费率1~M）

	//当前正向有/无功最大需量及发生时间（总、费率1~M）{0x117f, 0x8910, 0x8911, 0xa01f, 0xb01f, 0xa11f, 0xb11f, 0}, 
	{0xa01f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 11},	{1, M0797|PH3|DEMDMCUR}},	//当前正向有功最大需量（总、费率1~M）
	{0xb01f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 11}, 	{1, M0797|PH3|DEMDMCUR}},	//当前正向有最大需量发生时间（总、费率1~M）	

	//当前反向有/无功最大需量及发生时间（总、费率1~M）{0x118f, 0x8910, 0x8911, 0xa02f, 0xb02f, 0xa12f, 0xb12f, 0}, 
	{0xa02f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 12}, 	{1, M0797|PH3|DEMDMCUR}},	//当前反向有功最大需量（总、费率1~M）
	{0xb02f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},	{1, 12}, 	{1, M0797|PH3|DEMDMCUR}},	//当前反向有功最大需量发生时间（总、费率1~M）	

	{0x2200,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 21},		{1, M07|PH3|DMCUR}}, //月电压越限统计

	//=====================================================================================================
	//--------------------------月冻结配置成抄电表结算日冻结数据项-------------------------------------------
	{0xa41f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 11},			    {1, M0797|PH3|DEMMSETT}}, //月冻结, 上月正向有功需量(总、费率1~M)
	{0xb41f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 11},				{1, M0797|PH3|DEMMSETT}}, //月冻结, 上月正向有功需量发生时间(总、费率1~M)
	{0xa42f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 12},				{1, M0797|PH3|DEMMSETT}}, //月冻结, 上月反向有功需量（总、费率1~M）
	{0xb42f,  TIME_UNIT_MONTH,  1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 12},				{1, M0797|PH3|DEMMSETT}}, //月冻结, 上月反向有功需量发生时间（总、费率1~M）
	{0x941f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 13},				{1, M0797|PH13|MSETT}}, //月冻结，正向有功电能示值(总、费率1~M)	
	{0x942f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 15},				{1, M0797|PH13|MSETT}}, //月冻结, 反向有功电能示值（总、费率1~M）	
	{0x951f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 14},				{1, M0797|PH3|MSETT}}, //月冻结, 正向无功电能示值（总、费率1~M）
	{0x952f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 16},				{1, M0797|PH3|MSETT}}, //月冻结, 反向无功电能示值（总、费率1~M）
	{0x953f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 17},				{1, M0797|PH3|MSETT}}, //月冻结, 一象限无功电能示值（总、费率1~M）
	{0x955f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 18},				{1, M0797|PH3|MSETT}}, //月冻结, 二象限无功电能示值（总、费率1~M）
	{0x956f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 19},				{1, M0797|PH3|MSETT}}, //月冻结, 三象限无功电能示值（总、费率1~M）
	{0x954f,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 20},				{1, M0797|PH3|MSETT}}, //月冻结, 四象限无功电能示值（总、费率1~M）
	{0x2200,  TIME_UNIT_MONTH,	1, 		0,		{0,  0,  0,  0,  5,  0},    {1, 21},				{1, M07|PH3|MSETT}}, //月电压越限统计

	//---------告警公共数据-----------------
	{0x9010,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//当前正向有功总
	{0x9010,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},				//当前正向有功总
	{0x9020,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//当前反向有功总
	{0x9020,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//当前反向有功总
	{0x9110,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//当前组合无功1总
	{0x9110,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//当前组合无功1总
	{0x9120,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//当前组合无功2总
	{0x9120,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//当前组合无功2总
	{0xb61f,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//电压
	{0xb61f,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//电压
	{0x2011,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//AB线电压
	{0x2011,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//AB线电压
	{0x2012,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//BC线电压
	{0x2012,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//BC线电压
	{0x2013,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//CA线电压
	{0x2013,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//CA线电压
	{0x2014,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//A/AB相基波电压
	{0x2014,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//A/AB相基波电压
	{0x2015,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//B相基波电压
	{0x2015,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//B相基波电压
	{0x2016,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//C/CA相基波电压
	{0x2016,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//C/CA相基波电压
	{0xb62f,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//电流
	{0xb62f,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//电流
	{0x2021,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//A相基波电流
	{0x2021,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//A相基波电流
	{0x2022,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//B相基波电流
	{0x2022,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//B相基波电流
	{0x2023,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//C相基波电流
	{0x2023,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//C相基波电流
	{0xb63f,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//瞬时有功功率数据块
	{0xb63f,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//瞬时有功功率数据块
	{0xb64f,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//瞬时无功功率数据块
	{0xb64f,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {6, 173,174,175,213,206,204},				{6, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, 				//瞬时无功功率数据块
	{0xb65f,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {7, 182,183,184,185,179,180,181},			{7, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}},	//功率因素数据块
	{0xb65f,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {5, 173,174,175,213,206},					{5, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13, M0797|PH13}}, //功率因素数据块
	//---------失压-----------------
	{0xea14,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 182},				{1, M0797|PH3}},	//A相失压次数
	{0xea16,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 183},				{1, M0797|PH3}},	//B相失压次数
	{0xea18,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 184},				{1, M0797|PH3}},	//C相失压次数
	//---------失流-----------------
	{0xea40,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 179},				{1, M0797|PH3}},	//A失流次数
	{0xea42,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 180},				{1, M0797|PH3}},	//B相失流次数
	{0xea44,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 181},				{1, M0797|PH3}},	//C失流次数
	//---------潮流反向-----------------
	{0xea60,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 173},				{1, M0797|PH3}},	//A相潮流反向次数
	{0xea62,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 174},				{1, M0797|PH3}},	//B相潮流反向次数
	{0xea64,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 175},				{1, M0797|PH3}},	//C相潮流反向次数
	//---------电表编程时间更改-----------------
	{0xc811,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 213},				{1, M0797|PH3}},	//电表编程时间
	//---------继电器变位-----------------
	{0xc862,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 219},				{1, M0797|PH13}},	//电表状态字3
	//---------时钟异常-----------------
	{0xc010,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 222},				{1, M0797|PH13}},	//电表日期
	{0xc011,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 222},				{1, M0797|PH13}},	//电表时间
	//--------时段或费率更改-----------------
	{0xc33f,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 214},				{1, M0797|PH13}},	//电表日时段表1
	{0xc32f,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 214},				{1, M0797|PH13}},	//电表时区起始日期及日时段表号1
	//--------剩余电费不足-----------------
	{0xc9b0,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 203},				{1, M0797|PH13}},	//电表剩余金额
	//---------时钟电池电压低-----------------
	{0xc860,  TIME_UNIT_MTR,	1, 		0,		{0,  0,  0,  0,  0,  0},    {1, 210},				{1, M0797|PH13}},	//电表状态字1

};


//描述: 获取数据项的总个数
int MtrGetRdCtrlNum()
{
	return sizeof(g_MtrRdCtrl)/sizeof(TMtrRdCtrl);
}

//描述:取集抄抄读控制结构及数据项个数
//返回:集抄抄读控制结构
const TMtrRdCtrl* MtrGetRdCtrl(WORD* pwItemNum)
{
	*pwItemNum = sizeof(g_MtrRdCtrl)/sizeof(TMtrRdCtrl);
	return g_MtrRdCtrl;
}

