/*********************************************************************************************************
* Copyright (c) 2014,深圳科陆电子科技股份有限公司
* All rights reserved.
*
* 文件名称：DbCfg.h
* 摘    要：系统数据库的配置文件,主要用来输出计算出来的系统库变量大小
* 当前版本：1.0
* 作    者：autocomputer
* 完成日期：2014-10-13 16:58:28
*********************************************************************************************************/
#ifndef DBCFG_H
#define DBCFG_H

#define SECT2_DATA_SZ		135
#define SECT3_TMFLG_SZ		132
#define SECT3_DATA_SZ		1972
#endif //DBCFG_H
