//#include "stdafx.h"
#include "FaCfg.h"
#include "DbConst.h"
#include "FaConst.h"
#include "DbConst.h"
#include "ComStruct.h"
#include "FaAPI.h"
#include "DbAPI.h"
#include "ComAPI.h"
#include "MtrAPI.h"
#include "TaskDB.h"
//#include "FaProto.h"
#include "DbSgAPI.h"
#include "CommonTask.h"


const TProId2Sub g_ProId2Sub[] = 
{
	{0x0000ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x900f,0,}},		//当前组合有功电能数据块
	{0x0000ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x940f,0,}},				//月冻结组合有功电能数据块
	//{0x00010000,					0,					0,					0,					0,					{0x9010,0,}},		//当前正向有功总电能数据  任务曲线用到该单ID     					  			      				    			      					
	{0x0001ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x901f,0,}},		//当前正向有功电能数据块
	{0x0001ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x941f,0,}},				//月冻结正向有功电能数据块
	//{0x00020000,					0,					0,					0,					0,					{0x9020,0,}},		//当前反向有功总电能数据  任务曲线用到该单ID     					  			      				    			      					         					  			      				    			      					
	{0x0002ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x902f,0,}},		//当前反向有功电能数据块
	{0x0002ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x942f,0,}},				//月冻结反向有功电能数据块
	//{0x00030000,					0,					0,					0,					0,					{0x9110,0,}},		//当前组合无功1总电能数据  任务曲线用到该单ID     					  			      				    			      					         					  			      				    			      					         					  			      				    			      					
	{0x0003ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x911f,0,}},			//当前组合无功1电能数据块
	{0x0003ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x951f,0,}},				//月冻结组合无功1电能数据块
	//{0x00040000,					0,					0,					0,					0,					{0x9120,0,}},		//当前组合无功2总电能数据  任务曲线用到该单ID     					  			      				    			      					         					  			      				    			      					         					  			      				    			      					          					  			      				    			      					
	{0x0004ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x912f,0,}},					//当前组合无功2电能数据块
	{0x0004ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x952f,0,}},				//月冻结组合无功2电能数据块
	{0x0005ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x913f,0,}},				//当前第一象限无功电能数据块
	{0x0005ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x953f,0,}},				//月冻结第一象限无功电能数据块
	{0x0006ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x915f,0,}},				//当前第二象限无功电能数据块
	{0x0006ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x955f,0,}},				//月冻结第二象限无功电能数据块
	{0x0007ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x916f,0,}},				//当前第三象限无功电能数据块
	{0x0007ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x956f,0,}},				//月冻结第三象限无功电能数据块
	{0x0008ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x914f,0,}},				//当前第四象限无功电能数据块
	{0x0008ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x954f,0,}},				//月冻结第四象限无功电能数据块
	{0x0009ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x903f,0,}},					//当前正向视在电能数据块
	{0x0009ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x943f,0,}},				//月冻结正向视在电能数据块
	{0x000aff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x904f,0,}},					//当前反向视在电能数据块
	{0x000aff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x944f,0,}},				//月冻结反向视在电能数据块
	{0x00150000,					0,					0,					0,					0,					{0x9070,0,}},						//当前A相正向有功电能
	{0x00150001,					0,					0,					0,					0,					{0x9470,0,}},						//月冻结A相正向有功电能
	{0x00160000,					0,					0,					0,					0,					{0x9080,0,}},						//当前A相反向有功电能
	{0x00160001,					0,					0,					0,					0,					{0x9480,0,}},						//月冻结A相反向有功电能
	{0x00170000,					0,					0,					0,					0,					{0x9170,0,}},						//当前A相组合无功1电能
	{0x00170001,					0,					0,					0,					0,					{0xe312,0,}},						//月冻结A相组合无功1电能
	{0x00180000,					0,					0,					0,					0,					{0x9180,0,}},						//当前A相组合无功2电能
	{0x00180001,					0,					0,					0,					0,					{0xe313,0,}},						//月冻结A相组合无功2电能
	{0x00190000,					0,					0,					0,					0,					{0xe012,0,}},						//当前A相第一象限无功电能
	{0x00190001,					0,					0,					0,					0,					{0xe314,0,}},						//月冻结A相第一象限无功电能
	{0x001a0000,					0,					0,					0,					0,					{0xe013,0,}},						//当前A相第二象限无功电能
	{0x001a0001,					0,					0,					0,					0,					{0xe315,0,}},						//月冻结A相第二象限无功电能
	{0x001b0000,					0,					0,					0,					0,					{0xe014,0,}},						//当前A相第三象限无功电能
	{0x001b0001,					0,					0,					0,					0,					{0xe316,0,}},						//月冻结A相第三象限无功电能
	{0x001c0000,					0,					0,					0,					0,					{0xe015,0,}},						//当前A相第四象限无功电能
	{0x001c0001,					0,					0,					0,					0,					{0xe317,0,}},						//月冻结A相第四象限无功电能
	{0x001d0000,					0,					0,					0,					0,					{0xe010,0,}},						//当前A相正向视在电能
	{0x001d0001,					0,					0,					0,					0,					{0xe310,0,}},						//月冻结A相正向视在电能
	{0x001e0000,					0,					0,					0,					0,					{0xe011,0,}},						//当前A相反向视在电能
	{0x001e0001,					0,					0,					0,					0,					{0xe311,0,}},						//月冻结A相反向视在电能
	{0x00290000,					0,					0,					0,					0,					{0x9071,0,}},						//当前B相正向有功电能
	{0x00290001,					0,					0,					0,					0,					{0x9471,0,}},						//月冻结B相正向有功电能
	{0x002a0000,					0,					0,					0,					0,					{0x9081,0,}},						//当前B相反向有功电能
	{0x002a0001,					0,					0,					0,					0,					{0x9481,0,}},						//月冻结B相反向有功电能
	{0x002b0000,					0,					0,					0,					0,					{0x9171,0,}},						//当前B相组合无功1电能
	{0x002b0001,					0,					0,					0,					0,					{0xe322,0,}},						//月冻结B相组合无功1电能
	{0x002c0000,					0,					0,					0,					0,					{0x9181,0,}},						//当前B相组合无功2电能
	{0x002c0001,					0,					0,					0,					0,					{0xe323,0,}},						//月冻结B相组合无功2电能
	{0x002d0000,					0,					0,					0,					0,					{0xe022,0,}},						//当前B相第一象限无功电能
	{0x002d0001,					0,					0,					0,					0,					{0xe324,0,}},						//月冻结B相第一象限无功电能
	{0x002e0000,					0,					0,					0,					0,					{0xe023,0,}},						//当前B相第二象限无功电能
	{0x002e0001,					0,					0,					0,					0,					{0xe325,0,}},						//月冻结B相第二象限无功电能
	{0x002f0000,					0,					0,					0,					0,					{0xe024,0,}},						//当前B相第三象限无功电能
	{0x002f0001,					0,					0,					0,					0,					{0xe326,0,}},						//月冻结B相第三象限无功电能
	{0x00300000,					0,					0,					0,					0,					{0xe025,0,}},						//当前B相第四象限无功电能
	{0x00300001,					0,					0,					0,					0,					{0xe327,0,}},						//月冻结B相第四象限无功电能
	{0x00310000,					0,					0,					0,					0,					{0xe020,0,}},						//当前B相正向视在电能
	{0x00310001,					0,					0,					0,					0,					{0xe320,0,}},						//月冻结B相正向视在电能
	{0x00320000,					0,					0,					0,					0,					{0xe021,0,}},						//当前B相反向视在电能
	{0x00320001,					0,					0,					0,					0,					{0xe321,0,}},						//月冻结B相反向视在电能
	{0x003d0000,					0,					0,					0,					0,					{0x9072,0,}},						//当前C相正向有功电能
	{0x003d0001,					0,					0,					0,					0,					{0x9472,0,}},					  //月冻结C相正向有功电能
	{0x003e0000,					0,					0,					0,					0,					{0x9082,0,}},						//当前C相反向有功电能
	{0x003e0001,					0,					0,					0,					0,					{0x9482,0,}},						//月冻结C相反向有功电能
	{0x003f0000,					0,					0,					0,					0,					{0x9172,0,}},						//当前C相组合无功1电能
	{0x003f0001,					0,					0,					0,					0,					{0xe332,0,}},						//月冻结C相组合无功1电能
	{0x00400000,					0,					0,					0,					0,					{0x9182,0,}},						//当前C相组合无功2电能
	{0x00400001,					0,					0,					0,					0,					{0xe333,0,}},						//月冻结C相组合无功2电能
	{0x00410000,					0,					0,					0,					0,					{0xe032,0,}},						//当前C相第一象限无功电能
	{0x00410001,					0,					0,					0,					0,					{0xe334,0,}},						//月冻结C相第一象限无功电能
	{0x00420000,					0,					0,					0,					0,					{0xe033,0,}},						//当前C相第二象限无功电能
	{0x00420001,					0,					0,					0,					0,					{0xe335,0,}},						//月冻结C相第二象限无功电能
	{0x00430000,					0,					0,					0,					0,					{0xe034,0,}},						//当前C相第三象限无功电能
	{0x00430001,					0,					0,					0,					0,					{0xe336,0,}},						//月冻结C相第三象限无功电能
	{0x00440000,					0,					0,					0,					0,					{0xe035,0,}},						//当前C相第四象限无功电能
	{0x00440001,					0,					0,					0,					0,					{0xe337,0,}},						//月冻结C相第四象限无功电能
	{0x00450000,					0,					0,					0,					0,					{0xe030,0,}},						//当前C相正向视在电能
	{0x00450001,					0,					0,					0,					0,					{0xe330,0,}},						//月冻结C相正向视在电能
	{0x00460000,					0,					0,					0,					0,					{0xe031,0,}},						//当前C相反向视在电能
	{0x00460001,					0,					0,					0,					0,					{0xe331,0,}},					  //月冻结C相反向视在电能
	{0x00800000,					0,					0,					0,					0,					{0x9050,0,}},						//当前关联总电能
	{0x00800001,					0,					0,					0,					0,					{0x9450,0,}},						//月冻结关联总电能
	{0x00810000,					0,					0,					0,					0,					{0x9051,0,}},						//当前正向有功基波总电能
	{0x00810001,					0,					0,					0,					0,					{0x9451,0,}},						//月冻结正向有功基波总电能
	{0x00820000,					0,					0,					0,					0,					{0x9052,0,}},						//当前反向有功基波总电能
	{0x00820001,					0,					0,					0,					0,					{0x9452,0,}},						//月冻结反向有功基波总电能
	{0x00830000,					0,					0,					0,					0,					{0x9053,0,}},						//当前正向有功谐波总电能
	{0x00830001,					0,					0,					0,					0,					{0x9453,0,}},						//月冻结正向有功谐波总电能
	{0x00840000,					0,					0,					0,					0,					{0x9054,0,}},						//当前反向有功谐波总电能
	{0x00840001,					0,					0,					0,					0,					{0x9454,0,}},						//月冻结反向有功谐波总电能
	{0x00850000,					0,					0,					0,					0,					{0x9055,0,}},						//当前铜损有功总电能补偿量
	{0x00850001,					0,					0,					0,					0,					{0x9455,0,}},						//月冻结铜损有功总电能补偿量
	{0x00860000,					0,					0,					0,					0,					{0x9056,0,}},						//当前铁损有功总电能补偿量
	{0x00860001,					0,					0,					0,					0,					{0x9456,0,}},						//月冻结铁损有功总电能补偿量
	{0x00940000,					0,					0,					0,					0,					{0xe016,0,}},						//当前A相关联电能
	{0x00940001,					0,					0,					0,					0,					{0xe318,0,}},						//月冻结A相关联电能
	{0x00950000,					0,					0,					0,					0,					{0xe017,0,}},						//当前A相正向有功基波总电能
	{0x00950001,					0,					0,					0,					0,					{0xe319,0,}},						//月冻结A相正向有功基波总电能
	{0x00960000,					0,					0,					0,					0,					{0xe018,0,}},						//当前A相反向有功基波总电能
	{0x00960001,					0,					0,					0,					0,					{0xe31a,0,}},						//月冻结A相反向有功基波总电能
	{0x00970000,					0,					0,					0,					0,					{0xe019,0,}},						//当前A相正向有功谐波总电能
	{0x00970001,					0,					0,					0,					0,					{0xe31b,0,}},						//月冻结A相正向有功谐波总电能
	{0x00980000,					0,					0,					0,					0,					{0xe01a,0,}},						//当前A相反向有功谐波总电能
	{0x00980001,					0,					0,					0,					0,					{0xe31c,0,}},						//月冻结A相反向有功谐波总电能
	{0x00990000,					0,					0,					0,					0,					{0xe01b,0,}},						//当前A相铜损有功总电能补偿量
	{0x00990001,					0,					0,					0,					0,					{0xe31d,0,}},						//月冻结A相铜损有功总电能补偿量
	{0x009a0000,					0,					0,					0,					0,					{0xe01c,0,}},						//当前A相铁损有功总电能补偿量
	{0x009a0001,					0,					0,					0,					0,					{0xe31e,0,}},					  //月冻结A相铁损有功总电能补偿量
	{0x00a80000,					0,					0,					0,					0,					{0xe026,0,}},						//当前B相关联电能
	{0x00a80001,					0,					0,					0,					0,					{0xe328,0,}},						//月冻结B相关联电能
	{0x00a90000,					0,					0,					0,					0,					{0xe027,0,}},						//当前B相正向有功基波总电能
	{0x00a90001,					0,					0,					0,					0,					{0xe329,0,}},						//月冻结B相正向有功基波总电能
	{0x00aa0000,					0,					0,					0,					0,					{0xe028,0,}},						//当前B相反向有功基波总电能
	{0x00aa0001,					0,					0,					0,					0,					{0xe32a,0,}},						//月冻结B相反向有功基波总电能
	{0x00ab0000,					0,					0,					0,					0,					{0xe029,0,}},						//当前B相正向有功谐波总电能
	{0x00ab0001,					0,					0,					0,					0,					{0xe32b,0,}},						//月冻结B相正向有功谐波总电能
	{0x00ac0000,					0,					0,					0,					0,					{0xe02a,0,}},						//当前B相反向有功谐波总电能
	{0x00ac0001,					0,					0,					0,					0,					{0xe32c,0,}},						//月冻结B相反向有功谐波总电能
	{0x00ad0000,					0,					0,					0,					0,					{0xe02b,0,}},						//当前B相铜损有功总电能补偿量
	{0x00ad0001,					0,					0,					0,					0,					{0xe32d,0,}},						//月冻结B相铜损有功总电能补偿量
	{0x00ae0000,					0,					0,					0,					0,					{0xe02c,0,}},						//当前B相铁损有功总电能补偿量
	{0x00ae0001,					0,					0,					0,					0,					{0xe32e,0,}},						//月冻结B相铁损有功总电能补偿量
	{0x00bc0000,					0,					0,					0,					0,					{0xe036,0,}},						//当前C相关联电能
	{0x00bc0001,					0,					0,					0,					0,					{0xe338,0,}},						//月冻结C相关联电能
	{0x00bd0000,					0,					0,					0,					0,					{0xe037,0,}},						//当前C相正向有功基波总电能
	{0x00bd0001,					0,					0,					0,					0,					{0xe339,0,}},						//月冻结C相正向有功基波总电能
	{0x00be0000,					0,					0,					0,					0,					{0xe038,0,}},						//当前C相反向有功基波总电能
	{0x00be0001,					0,					0,					0,					0,					{0xe33a,0,}},						//月冻结C相反向有功基波总电能
	{0x00bf0001,					0,					0,					0,					0,					{0xe33b,0,}},						//月冻结C相正向有功谐波总电能
	{0x00c00000,					0,					0,					0,					0,					{0xe039,0,}},						//当前C相正向有功谐波总电能
	{0x00c00001,					0,					0,					0,					0,					{0xe33c,0,}},						//月冻结C相反向有功谐波总电能
	{0x00c10000,					0,					0,					0,					0,					{0xe03a,0,}},						//当前C相反向有功谐波总电能
	{0x00c10001,					0,					0,					0,					0,					{0xe33d,0,}},						//月冻结C相铜损有功总电能补偿量
	{0x00c20000,					0,					0,					0,					0,					{0xe03b,0,}},						//当前C相铜损有功总电能补偿量
	{0x00c20001,					0,					0,					0,					0,					{0xe33e,0,}},						//月冻结C相铁损有功总电能补偿量
	{0x00c30000,					0,					0,					0,					0,					{0xe03c,0,}},						//当前C相铁损有功总电能补偿量
	{0x0101ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa010,0xb010,0xa011,0xb011,0xa012,0xb012,0xa013,0xb013,0xa014,0xb014,0,}},					//当前正向有功最大需量及发生时间数据块
	{0x0101ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa410,0xb410,0xa411,0xb411,0xa412,0xb412,0xa413,0xb413,0xa414,0xb414,0,}},				//月冻结正向有功最大需量及发生时间数据块
	{0x0102ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa020,0xb020,0xa021,0xb021,0xa022,0xb022,0xa023,0xb023,0xa024,0xb024,0,}},					//当前反向有功最大需量及发生时间数据块
	{0x0102ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa420,0xb420,0xa421,0xb421,0xa422,0xb422,0xa423,0xb423,0xa424,0xb424,0,}},				//月冻结反向有功最大需量及发生时间数据块
	{0x0103ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa110,0xb110,0xa111,0xb111,0xa112,0xb112,0xa113,0xb113,0xa114,0xb114,0,}},					//当前组合无功1最大需量及发生时间数据块
	{0x0103ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa510,0xb510,0xa511,0xb511,0xa512,0xb512,0xa513,0xb513,0xa514,0xb514,0,}},				//月冻结组合无功1最大需量及发生时间数据块
	{0x0104ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa120,0xb120,0xa121,0xb121,0xa122,0xb122,0xa123,0xb123,0xa124,0xb124,0,}},					//当前组合无功2最大需量及发生时间数据块
	{0x0104ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa520,0xb520,0xa521,0xb521,0xa522,0xb522,0xa523,0xb523,0xa524,0xb524,0,}},				//月冻结组合无功2最大需量及发生时间数据块
	{0x0105ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa130,0xb130,0xa131,0xb131,0xa132,0xb132,0xa133,0xb133,0xa134,0xb134,0,}},				//当前第一象限最大需量及发生时间数据块
	{0x0105ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa530,0xb530,0xa531,0xb531,0xa532,0xb532,0xa533,0xb533,0xa534,0xb534,0,}},				//月冻结第一象限最大需量及发生时间数据块
	{0x0106ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa150,0xb150,0xa151,0xb151,0xa152,0xb152,0xa153,0xb153,0xa154,0xb154,0,}},				//当前第二象限最大需量及发生时间数据块
	{0x0106ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa550,0xb550,0xa551,0xb551,0xa552,0xb552,0xa553,0xb553,0xa554,0xb554,0,}},				//月冻结第二象限最大需量及发生时间数据块
	{0x0107ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa160,0xb160,0xa161,0xb161,0xa162,0xb162,0xa163,0xb163,0xa164,0xb164,0,}},				//当前第三象限最大需量及发生时间数据块
	{0x0107ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa560,0xb560,0xa561,0xb561,0xa562,0xb562,0xa563,0xb563,0xa564,0xb564,0,}},				//月冻结第三象限最大需量及发生时间数据块
	{0x0108ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa140,0xb140,0xa141,0xb141,0xa142,0xb142,0xa143,0xb143,0xa144,0xb144,0,}},				//当前第四象限最大需量及发生时间数据块
	{0x0108ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa540,0xb540,0xa541,0xb541,0xa542,0xb542,0xa543,0xb543,0xa544,0xb544,0,}},				//月冻结第四象限最大需量及发生时间数据块
	{0x0109ff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa030,0xb030,0xa031,0xb031,0xa032,0xb032,0xa033,0xb033,0xa034,0xb034,0,}},				//当前正向视在最大需量及发生时间数据块
	{0x0109ff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa430,0xb430,0xa431,0xb431,0xa432,0xb432,0xa433,0xb433,0xa434,0xb434,0,}},				//月冻结正向视在最大需量及发生时间数据块
	{0x010aff00,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa040,0xb040,0xa041,0xb041,0xa042,0xb042,0xa043,0xb043,0xa044,0xb044,0,}},				//当前反向视在最大需量及发生时间数据块
	{0x010aff01,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0xa440,0xb440,0xa441,0xb441,0xa442,0xb442,0xa443,0xb443,0xa444,0xb444,0,}},				//月冻结反向视在最大需量及发生时间数据块
	{0x01150000,					0,					0,					0,					0,					{0xe810,0xe910,0,}},						//当前A相正向有功最大需量及发生时间
	{0x01150001,					0,					0,					0,					0,					{0xeb10,0xec10,0,}},						//月冻结A相正向有功最大需量及发生时间
	{0x01160000,					0,					0,					0,					0,					{0xe811,0xe911,0,}},						//当前A相反向有功最大需量及发生时间
	{0x01160001,					0,					0,					0,					0,					{0xeb11,0xec11,0,}},						//月冻结A相反向有功最大需量及发生时间
	{0x01170000,					0,					0,					0,					0,					{0xe812,0xe912,0,}},						//当前A相组合无功1最大需量及发生时间
	{0x01170001,					0,					0,					0,					0,					{0xeb12,0xec12,0,}},						//月冻结A相组合无功1最大需量及发生时间
	{0x01180000,					0,					0,					0,					0,					{0xe813,0xe913,0,}},						//当前结A相组合无功2最大需量及发生时间
	{0x01180001,					0,					0,					0,					0,					{0xeb13,0xec13,0,}},						//月冻结A相组合无功2最大需量及发生时间
	{0x01190000,					0,					0,					0,					0,					{0xe814,0xe914,0,}},						//当前A相第一象限无功最大需量及发生时间
	{0x01190001,					0,					0,					0,					0,					{0xeb14,0xec14,0,}},						//月冻结A相第一象限无功最大需量及发生时间
	{0x011a0000,					0,					0,					0,					0,					{0xe815,0xe915,0,}},						//当前A相第二象限无功最大需量及发生时间
	{0x011a0001,					0,					0,					0,					0,					{0xeb15,0xec15,0,}},						//月冻结A相第二象限无功最大需量及发生时间
	{0x011b0000,					0,					0,					0,					0,					{0xe816,0xe916,0,}},						//当前A相第三象限无功最大需量及发生时间
	{0x011b0001,					0,					0,					0,					0,					{0xeb16,0xec16,0,}},						//月冻结A相第三象限无功最大需量及发生时间
	{0x011c0000,					0,					0,					0,					0,					{0xe817,0xe917,0,}},						//当前A相第四象限无功最大需量及发生时间
	{0x011c0001,					0,					0,					0,					0,					{0xeb17,0xec17,0,}},						//月冻结A相第四象限无功最大需量及发生时间
	{0x011d0000,					0,					0,					0,					0,					{0xe818,0xe918,0,}},						//当前A相正向视在最大需量及发生时间
	{0x011d0001,					0,					0,					0,					0,					{0xeb18,0xec18,0,}},						//月冻结A相正向视在最大需量及发生时间
	{0x011e0000,					0,					0,					0,					0,					{0xe819,0xe919,0,}},						//当前A相反向视在最大需量及发生时间
	{0x011e0001,					0,					0,					0,					0,					{0xeb19,0xec19,0,}},						//月冻结A相反向视在最大需量及发生时间
	{0x01290000,					0,					0,					0,					0,					{0xe820,0xe920,0,}},						//当前B相正向有功最大需量及发生时间
	{0x01290001,					0,					0,					0,					0,					{0xeb20,0xec20,0,}},						//月冻结B相正向有功最大需量及发生时间
	{0x012a0000,					0,					0,					0,					0,					{0xe821,0xe921,0,}},						//当前B相反向有功最大需量及发生时间
	{0x012a0001,					0,					0,					0,					0,					{0xeb21,0xec21,0,}},						//月冻结B相反向有功最大需量及发生时间
	{0x012b0000,					0,					0,					0,					0,					{0xe822,0xe922,0,}},						//当前B相组合无功1最大需量及发生时间
	{0x012b0001,					0,					0,					0,					0,					{0xeb22,0xec22,0,}},						//月冻结B相组合无功1最大需量及发生时间
	{0x012c0000,					0,					0,					0,					0,					{0xe823,0xe923,0,}},						//当前B相组合无功2最大需量及发生时间
	{0x012c0001,					0,					0,					0,					0,					{0xeb23,0xec23,0,}},						//月冻结B相组合无功2最大需量及发生时间
	{0x012d0000,					0,					0,					0,					0,					{0xe824,0xe924,0,}},						//当前B相第一象限无功最大需量及发生时间
	{0x012d0001,					0,					0,					0,					0,					{0xeb24,0xec24,0,}},						//月冻结B相第一象限无功最大需量及发生时间
	{0x012e0000,					0,					0,					0,					0,					{0xe825,0xe925,0,}},						//当前B相第二象限无功最大需量及发生时间
	{0x012e0001,					0,					0,					0,					0,					{0xeb25,0xec25,0,}},						//月冻结B相第二象限无功最大需量及发生时间
	{0x012f0000,					0,					0,					0,					0,					{0xe826,0xe926,0,}},						//当前B相第三象限无功最大需量及发生时间
	{0x012f0001,					0,					0,					0,					0,					{0xeb26,0xec26,0,}},						//月冻结B相第三象限无功最大需量及发生时间
	{0x01300000,					0,					0,					0,					0,					{0xe827,0xe927,0,}},						//当前B相第四象限无功最大需量及发生时间
	{0x01300001,					0,					0,					0,					0,					{0xeb27,0xec27,0,}},						//月冻结B相第四象限无功最大需量及发生时间
	{0x01310000,					0,					0,					0,					0,					{0xe828,0xe928,0,}},						//当前B相正向视在最大需量及发生时间
	{0x01310001,					0,					0,					0,					0,					{0xeb28,0xec28,0,}},						//月冻结B相正向视在最大需量及发生时间
	{0x01320000,					0,					0,					0,					0,					{0xe829,0xe929,0,}},						//当前B相反向视在最大需量及发生时间
	{0x01320001,					0,					0,					0,					0,					{0xeb29,0xec29,0,}},						//月冻结B相反向视在最大需量及发生时间
	{0x013d0000,					0,					0,					0,					0,					{0xe830,0xe930,0,}},						//当前C相正向有功最大需量及发生时间
	{0x013d0001,					0,					0,					0,					0,					{0xeb30,0xec30,0,}},						//月冻结C相正向有功最大需量及发生时间
	{0x013e0000,					0,					0,					0,					0,					{0xe831,0xe931,0,}},						//当前C相反向有功最大需量及发生时间
	{0x013e0001,					0,					0,					0,					0,					{0xeb31,0xec31,0,}},						//月冻结C相反向有功最大需量及发生时间
	{0x013f0000,					0,					0,					0,					0,					{0xe832,0xe932,0,}},						//当前C相组合无功1最大需量及发生时间
	{0x013f0001,					0,					0,					0,					0,					{0xeb32,0xec32,0,}},						//月冻结C相组合无功1最大需量及发生时间
	{0x01400000,					0,					0,					0,					0,					{0xe833,0xe933,0,}},						//当前C相组合无功2最大需量及发生时间
	{0x01400001,					0,					0,					0,					0,					{0xeb33,0xec33,0,}},						//月冻结C相组合无功2最大需量及发生时间
	{0x01410000,					0,					0,					0,					0,					{0xe834,0xe934,0,}},						//当前C相第一象限无功最大需量及发生时间
	{0x01410001,					0,					0,					0,					0,					{0xeb34,0xec34,0,}},						//月冻结C相第一象限无功最大需量及发生时间
	{0x01420000,					0,					0,					0,					0,					{0xe835,0xe935,0,}},						//当前C相第二象限无功最大需量及发生时间
	{0x01420001,					0,					0,					0,					0,					{0xeb35,0xec35,0,}},						//月冻结C相第二象限无功最大需量及发生时间
	{0x01430000,					0,					0,					0,					0,					{0xe836,0xe936,0,}},						//当前C相第三象限无功最大需量及发生时间
	{0x01430001,					0,					0,					0,					0,					{0xeb36,0xec36,0,}},						//月冻结C相第三象限无功最大需量及发生时间
	{0x01440000,					0,					0,					0,					0,					{0xe837,0xe937,0,}},						//当前C相第四象限无功最大需量及发生时间
	{0x01440001,					0,					0,					0,					0,					{0xeb37,0xec37,0,}},						//月冻结C相第四象限无功最大需量及发生时间
	{0x01450000,					0,					0,					0,					0,					{0xe838,0xe938,0,}},						//当前C相正向视在最大需量及发生时间
	{0x01450001,					0,					0,					0,					0,					{0xeb38,0xec38,0,}},						//月冻结C相正向视在最大需量及发生时间
	{0x01460000,					0,					0,					0,					0,					{0xe839,0xe939,0,}},						//当前C相反向视在最大需量及发生时间
	{0x01460001,					0,					0,					0,					0,					{0xeb39,0xec39,0,}},						//月冻结C相反向视在最大需量及发生时间
	{0x02010100, 0x0201ff00,					0,					0,					0,					{0xb611,0,}},					//A相电压  //97电压格式0XXX，07电压格式XXX.X 协议格式XXX.X
	{0x02010200, 0x0201ff00,					0,					0,					0,					{0xb612,0,}},					//B相电压
	{0x02010300, 0x0201ff00,					0,					0,					0,					{0xb613,0,}},					//C相电压
	{0x02010400, 0x0201ff00,					0,					0,					0,					{0x2011,0,}},					//AB线电压
	{0x02010500, 0x0201ff00,					0,					0,					0,					{0x2012,0,}},					//BC线电压
	{0x02010600, 0x0201ff00,					0,					0,					0,					{0x2013,0,}},					//CA线电压
	{0x02010700, 0x0201ff00,					0,					0,					0,					{0x2014,0,}},					//A/AB相基波电压
	{0x02010800, 0x0201ff00,					0,					0,					0,					{0x2015,0,}},					//B相基波电压
	{0x02010900, 0x0201ff00,					0,					0,					0,					{0x2016,0,}},					//C/CA相基波电压
	{0x0201ff00,					0,			T_BLK,				N_9,				C_03,				{0xb611,0xb612,0xb613,0x2011,0x2012,0x2013,0x2014,0x2015,0x2016,0,}},					//电压数据块
	{0x02020100, 0x0202ff00,					0,					0,					0,					{0xb621,0,}},					//A相电流 //97电流2字节格式XX.XX 07电流3字节格式XXX.XXX
	{0x02020200, 0x0202ff00,					0,					0,					0,					{0xb622,0,}},					//B相电流
	{0x02020300, 0x0202ff00,					0,					0,					0,					{0xb623,0,}},					//C相电流
	{0x02020400, 0x0202ff00,					0,					0,					0,					{0x2021,0,}},					//A相基波电流
	{0x02020500, 0x0202ff00,					0,					0,					0,					{0x2022,0,}},					//B相基波电流
	{0x02020600, 0x0202ff00,					0,					0,					0,					{0x2023,0,}},					//C相基波电流
	{0x0202ff00,                    0,			T_BLK,				N_6,				C_03,				{0xb621,0xb622,0xb623,0x2021,0x2022,0x2023,0,}},					//电流数据块
	{0x02030000, 0x0203ff00,					0,					0,					0,					{0xb630,0,}},					//瞬时总有功功率
	{0x02030100, 0x0203ff00,					0,					0,					0,					{0xb631,0,}},					//瞬时A相有功功率
	{0x02030200, 0x0203ff00,					0,					0,					0,					{0xb632,0,}},					//瞬时B相有功功率
	{0x02030300, 0x0203ff00,					0,					0,					0,					{0xb633,0,}},					//瞬时C相有功功率
	{0x0203ff00,					0,			T_BLK,				N_4,			 C_01,					{0xb63f,0,}},					//瞬时有功功率数据块
	{0x02040000, 0x0204ff00,					0,					0,					0,					{0xb640,0,}},					//瞬时总无功功率
	{0x02040100, 0x0204ff00,					0,					0,					0,					{0xb641,0,}},					//瞬时A相无功功率
	{0x02040200, 0x0204ff00,					0,					0,					0,					{0xb642,0,}},					//瞬时B相无功功率
	{0x02040300, 0x0204ff00,					0,					0,					0,					{0xb643,0,}},					//瞬时C相无功功率
	{0x0204ff00,					0,			T_BLK,				N_4,			 C_01,					{0xb64f,0,}},					//瞬时无功功率数据块
	{0x02050000, 0x0205ff00,					0,					0,					0,					{0xb670,0,}},					//瞬时总视在功率
	{0x02050100, 0x0205ff00,					0,					0,					0,					{0xb671,0,}},					//瞬时A相视在功率
	{0x02050200, 0x0205ff00,					0,					0,					0,					{0xb672,0,}},					//瞬时B相视在功率
	{0x02050300, 0x0205ff00,					0,					0,					0,					{0xb673,0,}},					//瞬时C相视在功率
	{0x0205ff00,					0,			T_BLK,				N_4,			 C_01,					{0xb67f,0,}},					//瞬时视在功率数据块
	{0x02060000, 0x0206ff00,					0,					0,					0,					{0xb650,0,}},					//总功率因素
	{0x02060100, 0x0206ff00,					0,					0,					0,					{0xb651,0,}},					//A相功率因素
	{0x02060200, 0x0206ff00,					0,					0,					0,					{0xb652,0,}},					//B相功率因素
	{0x02060300, 0x0206ff00,					0,					0,					0,					{0xb653,0,}},					//C相功率因素
	{0x0206ff00,					0,			T_BLK,				N_4,			 C_01,					{0xb65f,0,}},					//功率因素数据块
	{0x02070100,					0,					0,					0,					0,					{0xb660,0,}},					//Uab/Ua相位角
	{0x02070200,					0,					0,					0,					0,					{0xb661,0,}},					//Ub相位角
	{0x02070300,					0,					0,					0,					0,					{0xb662,0,}},					//Uc相位角
	{0x02070400,					0,					0,					0,					0,					{0xb663,0,}},					//Ia相位角
	{0x02070500,					0,					0,					0,					0,					{0xb664,0,}},					//Ib相位角
	{0x02070600,					0,					0,					0,					0,					{0xb665,0,}},					//Ic相位角
	{0x0207ff00,					0,					0,					0,					0,					{0xb66f,0,}},					//相角数据块
	{0x02080100,					0,					0,					0,					0,					{0xb711,0,}},												//A相电压波形失真度
	{0x02080200,					0,					0,					0,					0,					{0xb712,0,}},												//B相电压波形失真度
	{0x02080300,					0,					0,					0,					0,					{0xb713,0,}},												//C相电压波形失真度
	{0x0208ff00,					0,					0,					0,					0,					{0xb71f,0,}},												//电压波形失真度数据块
	{0x02090100,					0,					0,					0,					0,					{0xb721,0,}},												//A相电流波形失真度
	{0x02090200,					0,					0,					0,					0,					{0xb722,0,}},												//B相电流波形失真度
	{0x02090300,					0,					0,					0,					0,					{0xb723,0,}},												//C相电流波形失真度
	{0x0209ff00,					0,					0,					0,					0,					{0xb72f,0,}},												//电流波形失真度数据块
	{0x020a01ff,					0,			T_BLK,				N_21,				C_02,					{0xb711,0xb73f,0,}},					//A相电压谐波含量数据块
	{0x020a02ff,					0,			T_BLK,				N_21,				C_02,					{0xb712,0xb74f,0,}},					//B相电压谐波含量数据块
	{0x020a03ff,					0,			T_BLK,				N_21,				C_02,					{0xb713,0xb75f,0,}},					//C相电压谐波含量数据块
	{0x020b01ff,					0,			T_BLK,				N_21,				C_02,					{0xb721,0xb76f,0,}},					//A相电流谐波含量数据块
	{0x020b02ff,					0,			T_BLK,				N_21,				C_02,					{0xb722,0xb77f,0,}},					//B相电流谐波含量数据块	
	{0x020b03ff,					0,			T_BLK,				N_21,				C_02,					{0xb723,0xb78f,0,}},					//C相电流谐波含量数据块
	{0x02800001,					0,					0,					0,					0,					{0xb680,0,}},					//零线电流
	{0x02800002,					0,					0,					0,					0,					{0xb681,0,}},					//电网频率
	{0x02800003,					0,					0,					0,					0,					{0xb682,0,}},					//一分钟有功平均功率
	{0x02800004,					0,					0,					0,					0,					{0xb683,0,}},					//当前有功需量
	{0x02800005,					0,					0,					0,					0,					{0xb684,0,}},					//当前无功需量
	{0x02800006,					0,					0,					0,					0,					{0xb685,0,}},					//当前视在需量
	{0x02800007,					0,					0,					0,					0,					{0xb686,0,}},					//表内温度
	{0x02800008,					0,					0,					0,					0,					{0x8875,0,}},					//时钟电池电压(内部)
	{0x02800009,					0,					0,					0,					0,					{0xb688,0,}},					//停电抄表电池电压(外部)
	{0x0280000a,					0,					0,					0,					0,					{0xb689,0,}},					//内部电池工作时间
	{0x02800101,					0,					0,					0,					0,					{0x2031,0,}},					//A相短时闪变
	{0x02800102,					0,					0,					0,					0,					{0x2032,0,}},					//B相短时闪变
	{0x02800103,					0,					0,					0,					0,					{0x2033,0,}},					//C相短时闪变
	{0x02800104,					0,					0,					0,					0,					{0x2034,0,}},					//A相长时闪变
	{0x02800105,					0,					0,					0,					0,					{0x2035,0,}},					//B相长时闪变
	{0x02800106,					0,					0,					0,					0,					{0x2036,0,}},					//C相长时闪变
	{0x02800107,					0,					0,					0,					0,					{0x2037,0,}},					//电压正序分量
	{0x02800108,					0,					0,					0,					0,					{0x2038,0,}},					//电压负序分量
	{0x02800109,					0,					0,					0,					0,					{0x2039,0,}},					//电压零序分量
	{0x0280010a,					0,					0,					0,					0,					{0x203a,0,}},					//电压负序不平衡度
	{0x0280010b,					0,					0,					0,					0,					{0x203b,0,}},					//电流正序分量
	{0x0280010c,					0,					0,					0,					0,					{0x203c,0,}},					//电流负序分量
	{0x0280010d,					0,					0,					0,					0,					{0x203d,0,}},					//电流零序分量
	{0x0280010e,					0,					0,					0,					0,					{0x203e,0,}},					//电流负序不平衡度
	{0x028001ff,					0,					0,					0,					0,					{0x203f,0,}},					//本数据块
	{0x03010000,					0,					0,					0,					0,					{0xea14,0xea15,0xea16,0xea17,0xea18,0xea19,0,}},					//ABC三相失压总次数,总累计时间(终端末做此项)
	{0x030b0000,					0,					0,					0,					0,					{0xea40,0xea41,0xea42,0xea43,0xea44,0xea45,0,}},					//ABC三相失流总次数,总累计时间(终端末做此项)
	{0x030e0000,					0,					0,					0,					0,					{0xea60,0xea61,0xea62,0xea63,0xea64,0xea65,0,}},					//ABC三相潮流反向总次数,总累计时间(终端末做此项)
	{0x03100000,					0,					0,					0,					0,					{0x2200,0,}},					//本月电压合格率统计数据
	{0x03100100,					0,					0,					0,					0,					{0x2201,0,}},					//本月A相电压合格率统计数据
	{0x03100200,					0,					0,					0,					0,					{0x2202,0,}},					//本月B相电压合格率统计数据
	{0x03100300,					0,					0,					0,					0,					{0x2203,0,}},					//本月C相电压合格率统计数据
	{0x03300000,					0,					0,					0,					0,					{0xc810,0,}},					//编程总次数
	{0x03300100,					0,					0,					0,					0,					{0xc820,0,}},					//电表清零总次数
	{0x03300200,					0,					0,					0,					0,					{0xc830,0,}},					//需量清零总次数
	{0x04000101,					0,					0,					0,					0,					{0xc010,0,}},					//日期及星期
	{0x04000102,					0,					0,					0,					0,					{0xc011,0,}},					//时间
  	{0x04000501,			0x040005ff,					0,					0,					0,					{0xc860,0,}},					//电表运行状态字1
  	{0x04000502,			0x040005ff,					0,					0,					0,					{0xc861,0,}},					//电表运行状态字2
  	{0x04000503,			0x040005ff,					0,					0,					0,					{0xc862,0,}},					//电表运行状态字3
  	{0x04000504,			0x040005ff,					0,					0,					0,					{0xc863,0,}},					//电表运行状态字4
  	{0x04000505,			0x040005ff,					0,					0,					0,					{0xc864,0,}},					//电表运行状态字5
  	{0x04000506,			0x040005ff,					0,					0,					0,					{0xc865,0,}},					//电表运行状态字6
  	{0x04000507,			0x040005ff,					0,					0,					0,					{0xc866,0,}},					//电表运行状态字7
	{0x040005ff,					0,				T_BLK,					N_7,				C_03,				{0xc86f,0,}},		            //电表运行状态字数据块
	{0x050601ff,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x9a1f,0,}},					//日冻结正向有功电能数据块
	{0x050602ff,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x9a2f,0,}},					//日冻结反向有功电能数据块
	{0x050603ff,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x9b1f,0,}},					//日冻结组合无功1电能数据块
	{0x050604ff,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x9b2f,0,}},					//日冻结组合无功2电能数据块
	{0x050605ff,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x9b3f,0,}},					//日冻结第一象限无功电能数据块
	{0x050606ff,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x9b5f,0,}},					//日冻结第二象限无功电能数据块
	{0x050607ff,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x9b6f,0,}},					//日冻结第三象限无功电能数据块
	{0x050608ff,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x9b4f,0,}},					//日冻结第四象限无功电能数据块
	{0x050609ff,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x9c00,0x9c80,0x9c01,0x9c81,0x9c02,0x9c82,0x9c03,0x9c83,0x9c04,0x9c84,0,}},					//日冻结正向有功最大需量及发生时间数据块
	{0x05060aff,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x9c20,0x9ca0,0x9c21,0x9ca1,0x9c22,0x9ca2,0x9c23,0x9ca3,0x9c24,0x9ca4,0}},					//日冻结反向有功最大需量及发生时间数据块
	{0x05060bff,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x9c10,0x9c90,0x9c11,0x9c91,0x9c12,0x9c92,0x9c13,0x9c93,0x9c14,0x9c94,0,}},					//日冻结组合无功1最大需量及发生时间数据块
	{0x05060cff,					0,			T_FEE_BLK,				N_5,			C_01R,					{0x8908,0x9c30,0x9cb0,0x9c31,0x9cb1,0x9c32,0x9cb2,0x9c33,0x9cb3,0x9c34,0x9cb4,0,}},					//日冻结组合无功2最大需量及发生时间数据块
	{0xE0000100,					0,					0,					0,					0,					{0x8010,0,}},			//主站通讯地址
	{0xE0000101,					0,					0,					0,					0,					{0x8011,0,}},			//备用主站通信地址1
	{0xE0000102,					0,					0,					0,					0,					{0x8012,0,}},			//备用主站通信地址2
	{0xE0000103,					0,					0,					0,					0,					{0x8013,0,}},			//网关地址或者代理服务器地址和端口
	{0xE0000104,					0,					0,					0,					0,					{0x8014,0,}},			//APN
	{0xE0000105,					0,					0,					0,					0,					{0x8015,0,}},			//GPRS登录APN用户名或CDMA登陆用户名
	{0xE0000106,					0,					0,					0,					0,					{0x8016,0,}},			//GPRS登录APN密码或CDMA登陆秘密
	{0xE0000107,					0,					0,					0,					0,					{0x8017,0,}},			//心跳间隔
	{0xE0000108,					0,					0,					0,					0,					{0x8018,0,}},			//掉线重拨间隔
	{0xE0000109,					0,					0,					0,					0,					{0x8019,0,}},			//掉线后重拨次数,		(旧协议里没有,需另外扩充ID支持)
	{0xE000010A,					0,					0,					0,					0,					{0x801A,0,}},			//TCP/UDP标识
	{0xE000010B,					0,					0,					0,					0,					{0x801B,0,}},			//是否压缩				(旧协议里没有,需另外扩充ID支持)
	{0xE000010F,					0,					0,					0,					0,					{0x801f,0,}},			//以上数据项集合
	{0xE0000120,					0,					0,					0,					0,					{0x8020,0,}},			//终端省市区县码		(旧协议里字节数为2字节，新协议字节数改为3字节，需调整旧ID的字节数)
	{0xE0000121,					0,					0,					0,					0,					{0x8021,0,}},			//终端地址				(旧协议里字节数为2字节，新协议字节数改为3字节，需调整旧ID的字节数)
	{0xE0000122,					0,					0,					0,					0,					{0x8022,0,}},			//终端通信工作模式		(旧协议里没有,需另外扩充ID支持)
	{0xE0000123,					0,					0,					0,					0,					{0x8023,0,}},			//混合模式和服务器模式下TCP监听端口号		(旧协议里没有,需另外扩充ID支持)
	{0xE0000124,					0,					0,					0,					0,					{0x8024,0,}},			//终端当前通道IP地址						(旧协议里没有,需另外扩充ID支持)
	{0xE0000125,					0,					0,					0,					0,					{0x8025,0,}},			//终端当前通道子网掩码地址					(旧协议里没有,需另外扩充ID支持)
	{0xE0000126,					0,					0,					0,					0,					{0x8026,0,}},			//终端当前通道网关地址						(旧协议里没有,需另外扩充ID支持)
	{0xE0000127,					0,					0,					0,					0,					{0x8027,0,}},			//有线网络IP地址获取方式					(旧协议里没有,需另外扩充ID支持)
	{0xE000012F,					0,					0,					0,					0,					{0x802f,0,}},			//以上数据项集合							(旧协议里没有,需另外扩充ID支持)
	{0xE0000130,					0,					0,					0,					0,					{0x8030,0,}},			//终端时间
	{0xE0000131,					0,					0,					0,					0,					{0x8031,0,}},			//实时校时					
	{0xE0000140,					0,					0,					0,					0,					{0x8032,0,}},			//终端复位
	{0xE0000150,					0,					0,					0,					0,					{0x8033,0,}},			//告警主动上报屏蔽字						(旧协议里没有,需另外扩充ID支持)
	{0xE0000151,					0,					0,					0,					0,					{0x8034,0,}},			//告警判断屏蔽字							(旧协议里字节数为16字节，新协议字节数改为32字节，需调整旧ID的字节数)							
	{0xE0000152,					0,					0,					0,					0,					{0x8035,0,}},			//事件记录屏蔽字							(旧协议里没有,需另外扩充ID支持)
	{0xE0000160,					0,					0,					0,					0,					{0x8036,0,}},			//月结算电量								(旧协议是指结算时间，但新协议里指月结算电量)
	{0xE0000161,					0,					0,					0,					0,					{0x8037,0,}},			//日冻结电量								(旧协议里没有,需另外扩充ID支持)
	{0xE0000162,					0,					0,					0,					0,					{0x8038,0,}},			//月电压合格率数据冻结						(旧协议里没有,需另外扩充ID支持)
	{0xE0000163,					0,					0,					0,					0,					{0x8039,0,}},			//日电压合格率数据冻结						(旧协议里没有,需另外扩充ID支持)
	{0xE0000170,					0,					0,					0,					0,					{0x803A,0,}},				//消息认证码字段PW校验方式					(旧协议里没有,需另外扩充ID支持)
	{0xE0000171,					0,					0,					0,					0,					{0x803B,0,}},				//认证请求信息								(旧协议里没有,需另外扩充ID支持)
	{0xE0000172,					0,					0,					0,					0,					{0x803C,0,}},				//认证响应信息								(旧协议里没有,需另外扩充ID支持)
	{0xE0000173,					0,					0,					0,					0,					{0x803D,0,}},				//随机数信息								(旧协议里没有,需另外扩充ID支持)
	{0xE0000174,					0,					0,					0,					0,					{0x803E,0,}},				//随机数响应信息							(旧协议里没有,需另外扩充ID支持)
	{0xE0000180,					0,					0,					0,					0,					{0x8040,0,}},			//判断负荷过载时间	
	{0xE0000181,					0,					0,					0,					0,					{0x8041,0,}},			//判断负荷过载恢复时间
	{0xE0000182,					0,					0,					0,					0,					{0x8042,0,}},			//判断断相,失压时间
	{0xE0000183,					0,					0,					0,					0,					{0x8043,0,}},			//判断断相,失压恢复时间
	{0xE0000184,					0,					0,					0,					0,					{0x8044,0,}},			//判断电压逆相序时间
	{0xE0000185,					0,					0,					0,					0,					{0x8045,0,}},			//判断电压逆相序恢复时间
	{0xE0000186,					0,					0,					0,					0,					{0x8046,0,}},			//判断电流反极性时间
	{0xE0000187,					0,					0,					0,					0,					{0x8047,0,}},			//判断电流反极性恢复时间
	{0xE0000188,					0,					0,					0,					0,					{0x8048,0,}},			//电能表时钟异常阈值
	{0xE0000189,					0,					0,					0,					0,					{0x8049,0,}},			//电能表飞走阈值
	{0xE000018A,					0,					0,					0,					0,					{0x804A,0,}},			//电能表停走阈值
	{0xE000018B,					0,					0,					0,					0,					{0x804B,0,}},			//剩余金额不足阈值							(旧协议里没有,需另外扩充ID支持)
	{0xE000018C,					0,					0,					0,					0,					{0x804C,0,}},			//月通信流量越限值							(旧协议里没有,需另外扩充ID支持)
	{0xE000018F,					0,					0,					0,					0,					{0x804F,0,}},			//以上数据项集合
	{0xE0000200,					0,					0,					0,					0,					{0x8820,0,}},				//第1路485有效抄表通道定义					(旧协议里没有,需另外扩充ID支持)
	{0xE0000201,					0,					0,					0,					0,					{0x8821,0,}},				//第2路485有效抄表通道定义					(旧协议里没有,需另外扩充ID支持)
	{0xE0000202,					0,					0,					0,					0,					{0x8822,0,}},				//第3路有效抄表通道定义						(旧协议里没有,需另外扩充ID支持)
	{0xE0000203,					0,					0,					0,					0,					{0x8823,0,}},				//第4路有效抄表通道定义						(旧协议里没有,需另外扩充ID支持)
	{0xE0000204,					0,					0,					0,					0,					{0x8824,0,}},				//第5路有效抄表通道定义						(旧协议里没有,需另外扩充ID支持)
	{0xE0000205,					0,					0,					0,					0,					{0x8825,0,}},				//第6路有效抄表通道定义						
	{0xE0000206,					0,					0,					0,					0,					{0x8826,0,}},				//第7路有效抄表通道定义
	{0xE0000207,					0,					0,					0,					0,					{0x8827,0,}},				//第8路有效抄表通道定义
	{0xE0000208,					0,					0,					0,					0,					{0x8828,0,}},				//第9路有效抄表通道定义
	{0xE0000209,					0,					0,					0,					0,					{0x8829,0,}},				//第10路有效抄表通道定义
	{0xE000020A,					0,					0,					0,					0,					{0x882a,0,}},				//第11路有效抄表通道定义
	{0xE000020B,					0,					0,					0,					0,					{0x882b,0,}},				//第12路有效抄表通道定义
	{0xE000020C,					0,					0,					0,					0,					{0x882c,0,}},				//第13路有效抄表通道定义
	{0xE000020D,					0,					0,					0,					0,					{0x882d,0,}},				//第14路有效抄表通道定义
	{0xE000020E,					0,					0,					0,					0,					{0x882e,0,}},				//第15路有效抄表通道定义
	{0xE000020F,					0,					0,					0,					0,					{0x8830,0,}},				//第16路有效抄表通道定义
	{0xE0000210,					0,					0,					0,					0,					{0x8831,0,}},				//第17路有效抄表通道定义
	{0xE0000211,					0,					0,					0,					0,					{0x8832,0,}},				//第18路有效抄表通道定义
	{0xE0000212,					0,					0,					0,					0,					{0x8833,0,}},				//第19路有效抄表通道定义
	{0xE0000213,					0,					0,					0,					0,					{0x8834,0,}},				//第20路有效抄表通道定义
	{0xE0000214,					0,					0,					0,					0,					{0x8835,0,}},				//第21路有效抄表通道定义
	{0xE0000215,					0,					0,					0,					0,					{0x8836,0,}},				//第22路有效抄表通道定义
	{0xE0000216,					0,					0,					0,					0,					{0x8837,0,}},				//第23路有效抄表通道定义
	{0xE0000217,					0,					0,					0,					0,					{0x8838,0,}},				//第24路有效抄表通道定义
	{0xE0000218,					0,					0,					0,					0,					{0x8839,0,}},				//第25路有效抄表通道定义
	{0xE0000219,					0,					0,					0,					0,					{0x883a,0,}},				//第26路有效抄表通道定义
	{0xE000021A,					0,					0,					0,					0,					{0x883b,0,}},				//第27路有效抄表通道定义
	{0xE000021B,					0,					0,					0,					0,					{0x883c,0,}},				//第28路有效抄表通道定义
	{0xE000021C,					0,					0,					0,					0,					{0x883d,0,}},				//第29路有效抄表通道定义
	{0xE000021D,					0,					0,					0,					0,					{0x883e,0,}},				//第30路有效抄表通道定义
	{0xE000021E,					0,					0,					0,					0,					{0x8840,0,}},				//第31路有效抄表通道定义
	{0xE000021F,					0,					0,					0,					0,					{0x8841,0,}},				//载波通道有效抄表通道定义
	{0xE0000220,					0,					0,					0,					0,					{0x8842,0,}},				//无线通道有效抄表通道定义					(旧协议里没有,需另外扩充ID支持)
	{0xE0000221,					0,					0,					0,					0,					{0x8843,0,}},				//有效的抄表参数配置表总数					(旧协议里没有,需另外扩充ID支持)
	{0xE0000300,					0,					0,					0,					0,					{0x8100,0,}},			//有效的普通任务总数
	{0xE0000400,					0,					0,					0,					0,					{0x8101,0,}},			//有效的中继任务总数						(旧协议里没有,需另外扩充ID支持)	
	{0xE0000500,					0,					0,					0,					0,					{0x8300,0,}},			//模拟量数量
	{0xE0000501,					0,					0,					0,					0,					{0x8301,0,}},			//模拟量号1
	{0xE0000502,					0,					0,					0,					0,					{0x8302,0,}},			//模拟量号2
	{0xE0000503,					0,					0,					0,					0,					{0x8303,0,}},			//模拟量号3
	{0xE0000504,					0,					0,					0,					0,					{0x8304,0,}},			//模拟量号4
	{0xE0000505,					0,					0,					0,					0,					{0x8305,0,}},			//模拟量号5
	{0xE0000506,					0,					0,					0,					0,					{0x8306,0,}},			//模拟量号6
	{0xE0000507,					0,					0,					0,					0,					{0x8307,0,}},			//模拟量号7
	{0xE0000508,					0,					0,					0,					0,					{0x8308,0,}},			//模拟量号8
	{0xE0000509,					0,					0,					0,					0,					{0x8309,0,}},			//模拟量号9
	{0xE000050A,					0,					0,					0,					0,					{0x830A,0,}},			//模拟量号10
	{0xE000050B,					0,					0,					0,					0,					{0x830B,0,}},			//模拟量号11
	{0xE000050C,					0,					0,					0,					0,					{0x830C,0,}},			//模拟量号12
	{0xE000050D,					0,					0,					0,					0,					{0x830D,0,}},			//模拟量号13
	{0xE000050E,					0,					0,					0,					0,					{0x830E,0,}},			//模拟量号14
	{0xE000050F,					0,					0,					0,					0,					{0x830F,0,}},			//模拟量号15
	{0xE00005FE,					0,					0,					0,					0,					{0x83FE,0,}},			//模拟量状态标记
	{0xE00005FF,					0,					0,					0,					0,					{0x83FF,0,}},			//以上数据项集合
	{0xE0000600,					0,					0,					0,					0,					{0x8400,0,}},			//脉冲量数量
	{0xE0000601,					0,					0,					0,					0,					{0x8401,0,}},			//脉冲量号1				(旧协议5字节,新协议6字节，需调整旧ID的字节数) 
	{0xE0000602,					0,					0,					0,					0,					{0x8402,0,}},			//脉冲量号2
	{0xE0000603,					0,					0,					0,					0,					{0x8403,0,}},			//脉冲量号3
	{0xE0000604,					0,					0,					0,					0,					{0x8404,0,}},			//脉冲量号4
	{0xE0000605,					0,					0,					0,					0,					{0x8405,0,}},			//脉冲量号5
	{0xE0000606,					0,					0,					0,					0,					{0x8406,0,}},			//脉冲量号6
	{0xE0000607,					0,					0,					0,					0,					{0x8407,0,}},			//脉冲量号7
	{0xE0000608,					0,					0,					0,					0,					{0x8408,0,}},			//脉冲量号8
	{0xE0000609,					0,					0,					0,					0,					{0x8409,0,}},			//脉冲量号9
	{0xE000060A,					0,					0,					0,					0,					{0x840A,0,}},			//脉冲量号10
	{0xE000060B,					0,					0,					0,					0,					{0x840B,0,}},			//脉冲量号11
	{0xE000060C,					0,					0,					0,					0,					{0x840C,0,}},			//脉冲量号12
	{0xE000060D,					0,					0,					0,					0,					{0x840D,0,}},			//脉冲量号13
	{0xE000060E,					0,					0,					0,					0,					{0x840E,0,}},			//脉冲量号14
	{0xE000060F,					0,					0,					0,					0,					{0x840F,0,}},			//脉冲量号15
	{0xE00006FE,					0,					0,					0,					0,					{0x84FE,0,}},			//脉冲量状态标记
	{0xE00006FF,					0,					0,					0,					0,					{0x84FF,0,}},			//以上数据项集合
	{0xE0000700,					0,					0,					0,					0,					{0x8500,0,}},			//运算量数量
	{0xE0000701,					0,					0,					0,					0,					{0x8501,0,}},			//运算量号1          (旧协议中有运算量相关参数,但工程中未加入这些参数，按照对应关系需增加旧ID数据项，并按新协议调整字节数) 
	{0xE0000702,					0,					0,					0,					0,					{0x8502,0,}},			//运算量号2
	{0xE0000703,					0,					0,					0,					0,					{0x8503,0,}},			//运算量号3
	{0xE0000704,					0,					0,					0,					0,					{0x8504,0,}},			//运算量号4
	{0xE0000705,					0,					0,					0,					0,					{0x8505,0,}},			//运算量号5
	{0xE0000706,					0,					0,					0,					0,					{0x8506,0,}},			//运算量号6
	{0xE0000707,					0,					0,					0,					0,					{0x8507,0,}},			//运算量号7
	{0xE0000708,					0,					0,					0,					0,					{0x8508,0,}},			//运算量号8
	{0xE0000709,					0,					0,					0,					0,					{0x8509,0,}},			//运算量号9
	{0xE000070A,					0,					0,					0,					0,					{0x850A,0,}},			//运算量号10
	{0xE000070B,					0,					0,					0,					0,					{0x850B,0,}},			//运算量号11
	{0xE000070C,					0,					0,					0,					0,					{0x850C,0,}},			//运算量号12
	{0xE000070D,					0,					0,					0,					0,					{0x850D,0,}},			//运算量号13
	{0xE000070E,					0,					0,					0,					0,					{0x850E,0,}},			//运算量号14
	{0xE000070F,					0,					0,					0,					0,					{0x850F,0,}},			//运算量号15
	{0xE00007FE,					0,					0,					0,					0,					{0x85FE,0,}},			//运算量状态标记
	{0xE00007FF,					0,					0,					0,					0,					{0x85FF,0,}},			//以上数据项集合
	{0xE0000800,					0,					0,					0,					0,					{0x8600,0,}},			//差动规则数量
	{0xE0000801,					0,					0,					0,					0,					{0x8601,0,}},			//差动规则量号1				(旧协议11字节,新协议15字节，需调整旧ID的字节数) 
	{0xE0000802,					0,					0,					0,					0,					{0x8602,0,}},			//差动规则量号2
	{0xE0000803,					0,					0,					0,					0,					{0x8603,0,}},			//差动规则量号3
	{0xE0000804,					0,					0,					0,					0,					{0x8604,0,}},			//差动规则量号4
	{0xE0000805,					0,					0,					0,					0,					{0x8605,0,}},			//差动规则量号5
	{0xE0000806,					0,					0,					0,					0,					{0x8606,0,}},			//差动规则量号6
	{0xE0000807,					0,					0,					0,					0,					{0x8607,0,}},			//差动规则量号7
	{0xE0000808,					0,					0,					0,					0,					{0x8608,0,}},			//差动规则量号8
	{0xE0000809,					0,					0,					0,					0,					{0x8609,0,}},			//差动规则量号9
	{0xE000080A,					0,					0,					0,					0,					{0x860A,0,}},			//差动规则量号10
	{0xE000080B,					0,					0,					0,					0,					{0x860B,0,}},			//差动规则量号11
	{0xE000080C,					0,					0,					0,					0,					{0x860C,0,}},			//差动规则量号12
	{0xE000080D,					0,					0,					0,					0,					{0x860D,0,}},			//差动规则量号13
	{0xE000080E,					0,					0,					0,					0,					{0x860E,0,}},			//差动规则量号14
	{0xE000080F,					0,					0,					0,					0,					{0x860F,0,}},			//差动规则量号15
	{0xE00008FE,					0,					0,					0,					0,					{0x86FE,0,}},			//差动规则量状态标记
	{0xE00008FF,					0,					0,					0,					0,					{0x86FF,0,}},			//以上数据项集合
	{0xE0000A00,					0,					0,					0,					0,					{0x871F,0,}},			//485端口号1              (旧协议0x871F的顺序是 波特率,校验位,数据位,停止位,端口功能,新协议是端口功能,波特率,校验位,数据位,停止位，需调整子ID功能顺序)
	{0xE0000A01,					0,					0,					0,					0,					{0x872F,0,}},			//485端口号2              (旧协议0x872F的顺序是 波特率,校验位,数据位,停止位,端口功能,新协议是端口功能,波特率,校验位,数据位,停止位，需调整子ID功能顺序)
	{0xE0000A02,					0,					0,					0,					0,					{0x875F,0,}},			//485端口号3              (旧协议0x875F的顺序是 波特率,校验位,数据位,停止位,端口功能,新协议是端口功能,波特率,校验位,数据位,停止位，需调整子ID功能顺序)
	{0xE0000A03,					0,					0,					0,					0,					{0x876F,0,}},			//485端口号4              (旧协议0x876F的顺序是 波特率,校验位,数据位,停止位,端口功能,新协议是端口功能,波特率,校验位,数据位,停止位，需调整子ID功能顺序)
	{0xE0000A04,					0,					0,					0,					0,					{0x873F,0,}},			//232端口号5              (旧协议0x875F的顺序是 波特率,校验位,数据位,停止位,端口功能,新协议是端口功能,波特率,校验位,数据位,停止位，需调整子ID功能顺序)
	{0xE0000A05,					0,					0,					0,					0,					{0x874F,0,}},			//红外端口号6              (旧协议0x876F的顺序是 波特率,校验位,数据位,停止位,端口功能,新协议是端口功能,波特率,校验位,数据位,停止位，需调整子ID功能顺序)
	{0xE0000A20,					0,					0,					0,					0,					{0x8810,0,}},			//级联从终端地址1~4
	{0xE0000A21,					0,					0,					0,					0,					{0x8811,0,}},			//级联主终端地址
	{0xE0000A22,					0,					0,					0,					0,					{0x8812,0,}},			//被抄终端地址				(旧协议里没有,需另外扩充ID支持)
	{0xE0000A23,					0,					0,					0,					0,					{0x8813,0,}},			//主终端等待从终端应答的超时判定时间
	{0xE0000A24,					0,					0,					0,					0,					{0x8814,0,}},			//从终端等待主终端级联控制命令的超时判定时间
	{0xE0000A25,					0,					0,					0,					0,					{0x8815,0,}},			//级联台区终端CT倍率
	{0xE0000A26,					0,					0,					0,					0,					{0x8816,0,}},			//级联台区终端PT倍率
	{0xE0000B00,					0,					0,					0,					0,					{0x8817,0,}},			//规约版本号				(旧协议里没有,需另外扩充ID支持)
	{0xE0000B01,					0,					0,					0,					0,					{0x8818,0,}},			//终端软件版本号			(旧协议8字节,新协议6字节，需调整旧ID的字节数) 
	{0xE0000B02,					0,					0,					0,					0,					{0x8819,0,}},			//终端硬件版本号		
	{0xE0000C00,					0,					0,					0,					0,					{0x8200,0,}},			//开关节点类型,开关编号0	(旧协议中没有相关参数,按照对应关系需扩充ID数据项，并按新协议调整字节数) 
	{0xE0000C01,					0,					0,					0,					0,					{0x8201,0,}},			//开关节点类型,开关编号1
	{0xE0000C02,					0,					0,					0,					0,					{0x8202,0,}},			//开关节点类型,开关编号2
	{0xE0000C03,					0,					0,					0,					0,					{0x8203,0,}},			//开关节点类型,开关编号3
	{0xE0000C04,					0,					0,					0,					0,					{0x8204,0,}},			//开关节点类型,开关编号4
	{0xE0000C05,					0,					0,					0,					0,					{0x8205,0,}},			//开关节点类型,开关编号5
	{0xE0000C06,					0,					0,					0,					0,					{0x8206,0,}},			//开关节点类型,开关编号6
	{0xE0000C07,					0,					0,					0,					0,					{0x8207,0,}},			//开关节点类型,开关编号7
	{0xE0000C08,					0,					0,					0,					0,					{0x8208,0,}},			//开关节点类型,开关编号8
	{0xE0000C09,					0,					0,					0,					0,					{0x8209,0,}},			//开关节点类型,开关编号9
	{0xE0000C0A,					0,					0,					0,					0,					{0x820A,0,}},			//开关节点类型,开关编号A
	{0xE0000C0B,					0,					0,					0,					0,					{0x820B,0,}},			//开关节点类型,开关编号B
	{0xE0000C0C,					0,					0,					0,					0,					{0x820C,0,}},			//开关节点类型,开关编号C
	{0xE0000C0D,					0,					0,					0,					0,					{0x820D,0,}},			//开关节点类型,开关编号D
	{0xE0000C0E,					0,					0,					0,					0,					{0x820E,0,}},			//开关节点类型,开关编号E
	{0xE0000C0F,					0,					0,					0,					0,					{0x820F,0,}},			//以上数据项集合
	{0xE0000C10,					0,					0,					0,					0,					{0x8210,0,}},			//输入开关状态,开关编号0
	{0xE0000C11,					0,					0,					0,					0,					{0x8211,0,}},			//输入开关状态,开关编号1
	{0xE0000C12,					0,					0,					0,					0,					{0x8212,0,}},			//输入开关状态,开关编号2
	{0xE0000C13,					0,					0,					0,					0,					{0x8213,0,}},			//输入开关状态,开关编号3
	{0xE0000C14,					0,					0,					0,					0,					{0x8214,0,}},			//输入开关状态,开关编号4
	{0xE0000C15,					0,					0,					0,					0,					{0x8215,0,}},			//输入开关状态,开关编号5
	{0xE0000C16,					0,					0,					0,					0,					{0x8216,0,}},			//输入开关状态,开关编号6
	{0xE0000C17,					0,					0,					0,					0,					{0x8217,0,}},			//输入开关状态,开关编号7
	{0xE0000C18,					0,					0,					0,					0,					{0x8218,0,}},			//输入开关状态,开关编号8
	{0xE0000C19,					0,					0,					0,					0,					{0x8219,0,}},			//输入开关状态,开关编号9
	{0xE0000C1A,					0,					0,					0,					0,					{0x821A,0,}},			//输入开关状态,开关编号A
	{0xE0000C1B,					0,					0,					0,					0,					{0x821B,0,}},			//输入开关状态,开关编号B
	{0xE0000C1C,					0,					0,					0,					0,					{0x821C,0,}},			//输入开关状态,开关编号C
	{0xE0000C1D,					0,					0,					0,					0,					{0x821D,0,}},			//输入开关状态,开关编号D
	{0xE0000C1E,					0,					0,					0,					0,					{0x821E,0,}},			//输入开关状态,开关编号E
	{0xE0000C1F,					0,					0,					0,					0,					{0x821F,0,}},			//以上数据项集合
	{0xE0000C20,					0,					0,					0,					0,					{0x8220,0,}},			//输出开关状态,开关编号0
	{0xE0000C21,					0,					0,					0,					0,					{0x8221,0,}},			//输出开关状态,开关编号1
	{0xE0000C22,					0,					0,					0,					0,					{0x8222,0,}},			//输出开关状态,开关编号2
	{0xE0000C23,					0,					0,					0,					0,					{0x8223,0,}},			//输出开关状态,开关编号3
	{0xE0000C24,					0,					0,					0,					0,					{0x8224,0,}},			//输出开关状态,开关编号4
	{0xE0000C25,					0,					0,					0,					0,					{0x8225,0,}},			//输出开关状态,开关编号5
	{0xE0000C26,					0,					0,					0,					0,					{0x8226,0,}},			//输出开关状态,开关编号6
	{0xE0000C27,					0,					0,					0,					0,					{0x8227,0,}},			//输出开关状态,开关编号7
	{0xE0000C28,					0,					0,					0,					0,					{0x8228,0,}},			//输出开关状态,开关编号8
	{0xE0000C29,					0,					0,					0,					0,					{0x8229,0,}},			//输出开关状态,开关编号9
	{0xE0000C2A,					0,					0,					0,					0,					{0x822A,0,}},			//输出开关状态,开关编号A
	{0xE0000C2B,					0,					0,					0,					0,					{0x822B,0,}},			//输出开关状态,开关编号B
	{0xE0000C2C,					0,					0,					0,					0,					{0x822C,0,}},			//输出开关状态,开关编号C
	{0xE0000C2D,					0,					0,					0,					0,					{0x822D,0,}},			//输出开关状态,开关编号D
	{0xE0000C2E,					0,					0,					0,					0,					{0x822E,0,}},			//输出开关状态,开关编号E
	{0xE0000C2F,					0,					0,					0,					0,					{0x822F,0,}},			//以上数据项集合
	{0xE0000C30,					0,					0,					0,					0,					{0x8230,0,}},			//输出开关轮次,开关编号0
	{0xE0000C31,					0,					0,					0,					0,					{0x8231,0,}},			//输出开关轮次,开关编号1
	{0xE0000C32,					0,					0,					0,					0,					{0x8232,0,}},			//输出开关轮次,开关编号2
	{0xE0000C33,					0,					0,					0,					0,					{0x8233,0,}},			//输出开关轮次,开关编号3
	{0xE0000C34,					0,					0,					0,					0,					{0x8234,0,}},			//输出开关轮次,开关编号4
	{0xE0000C35,					0,					0,					0,					0,					{0x8235,0,}},			//输出开关轮次,开关编号5
	{0xE0000C36,					0,					0,					0,					0,					{0x8236,0,}},			//输出开关轮次,开关编号6
	{0xE0000C37,					0,					0,					0,					0,					{0x8237,0,}},			//输出开关轮次,开关编号7
	{0xE0000C38,					0,					0,					0,					0,					{0x8238,0,}},			//输出开关轮次,开关编号8
	{0xE0000C39,					0,					0,					0,					0,					{0x8239,0,}},			//输出开关轮次,开关编号9
	{0xE0000C3A,					0,					0,					0,					0,					{0x823A,0,}},			//输出开关轮次,开关编号A
	{0xE0000C3B,					0,					0,					0,					0,					{0x823B,0,}},			//输出开关轮次,开关编号B
	{0xE0000C3C,					0,					0,					0,					0,					{0x823C,0,}},			//输出开关轮次,开关编号C
	{0xE0000C3D,					0,					0,					0,					0,					{0x823D,0,}},			//输出开关轮次,开关编号D
	{0xE0000C3E,					0,					0,					0,					0,					{0x823E,0,}},			//输出开关轮次,开关编号E
	{0xE0000C3F,					0,					0,					0,					0,					{0x823F,0,}},			//以上数据项集合
	{0xE0000C40,					0,					0,					0,					0,					{0x80A0,0,}},			//遥控拉闸时间		
	{0xE0000C50,					0,					0,					0,					0,					{0x80A1,0,}},			//保电状态
	{0xE0000C60,					0,					0,					0,					0,					{0x8060,0,}},			//功率控制是否有效
	{0xE0000C61,					0,					0,					0,					0,					{0x8061,0,}},			//月度电量控制是否有效		(旧协议里月度电量控制是否有效和购电控制是否有效是同一个字节,新协议是各自有ID对应)
	{0xE0000C62,					0,					0,					0,					0,					{0x8062,0,}},			//购电量控制是否有效		(旧协议里没有,需另外扩充ID支持)
	{0xE0000C63,					0,					0,					0,					0,					{0x8063,0,}},			//功率控制各轮次跳闸是否有效 
	{0xE0000C64,					0,					0,					0,					0,					{0x8064,0,}},			//月电量控制跳闸轮次有效标志
	{0xE0000C65,					0,					0,					0,					0,					{0x8065,0,}},			//购电量控制跳闸轮次有效标志(旧协议里没有,需另外扩充ID支持)
	{0xE0000C66,					0,					0,					0,					0,					{0x8066,0,}},			//超过设定值跳闸的过负荷持续时间
	{0xE0000C67,					0,					0,					0,					0,					{0x8067,0,}},			//超过设定值跳闸恢复的负荷恢复持续时间
	{0xE0000C68,					0,					0,					0,					0,					{0x8068,0,}},			//拉闸命令告警延时
	{0xE0000C69,					0,					0,					0,					0,					{0x8069,0,}},			//功率控制用功率累加标志	(旧协议9字节,新协议17字节，需调整旧ID的字节数) 
	{0xE0000C6A,					0,					0,					0,					0,					{0x806A,0,}},			//电量控制用电量累加标志	(旧协议9字节,新协议17字节，需调整旧ID的字节数) 
	{0xE0000C6B,					0,					0,					0,					0,					{0x806B,0,}},			//功率定值浮动系数
	{0xE0000C6C,					0,					0,					0,					0,					{0x806C,0,}},			//月电量控定值浮动系数
	{0xE0000C6D,					0,					0,					0,					0,					{0x806D,0,}},			//最低负荷
	{0xE0000C70,					0,					0,					0,					0,					{0x80A2,0,}},			//临时限电控有效标识
	{0xE0000C71,					0,					0,					0,					0,					{0x80A3,0,}},			//临时限电的计算滑窗时间
	{0xE0000D00,					0,					0,					0,					0,					{0x8050,0,}},			//功率控制系列1,时段数
	{0xE0000D01,					0,					0,					0,					0,					{0x8051,0,}},			//功率控制系列1,时段1
	{0xE0000D02,					0,					0,					0,					0,					{0x8052,0,}},			//功率控制系列1,时段2
	{0xE0000D03,					0,					0,					0,					0,					{0x8053,0,}},			//功率控制系列1,时段3
	{0xE0000D04,					0,					0,					0,					0,					{0x8054,0,}},			//功率控制系列1,时段4
	{0xE0000D05,					0,					0,					0,					0,					{0x8055,0,}},			//功率控制系列1,时段5
	{0xE0000D06,					0,					0,					0,					0,					{0x8056,0,}},			//功率控制系列1,时段6
	{0xE0000D07,					0,					0,					0,					0,					{0x8057,0,}},			//功率控制系列1,时段7
	{0xE0000D08,					0,					0,					0,					0,					{0x8058,0,}},			//功率控制系列1,时段8
	{0xE0000D09,					0,					0,					0,					0,					{0x8059,0,}},			//功率控制系列1,执行时间
	{0xE0000D0F,					0,					0,					0,					0,					{0x805F,0,}},			//以上数据项集合
	{0xE0000D10,					0,					0,					0,					0,					{0x8070,0,}},			//功率控制系列2,时段数
	{0xE0000D11,					0,					0,					0,					0,					{0x8071,0,}},			//功率控制系列2,时段1
	{0xE0000D12,					0,					0,					0,					0,					{0x8072,0,}},			//功率控制系列2,时段2
	{0xE0000D13,					0,					0,					0,					0,					{0x8073,0,}},			//功率控制系列2,时段3
	{0xE0000D14,					0,					0,					0,					0,					{0x8074,0,}},			//功率控制系列2,时段4
	{0xE0000D15,					0,					0,					0,					0,					{0x8075,0,}},			//功率控制系列2,时段5
	{0xE0000D16,					0,					0,					0,					0,					{0x8076,0,}},			//功率控制系列2,时段6
	{0xE0000D17,					0,					0,					0,					0,					{0x8077,0,}},			//功率控制系列2,时段7
	{0xE0000D18,					0,					0,					0,					0,					{0x8078,0,}},			//功率控制系列2,时段8
	{0xE0000D19,					0,					0,					0,					0,					{0x8079,0,}},			//功率控制系列2,执行时间
	{0xE0000D1F,					0,					0,					0,					0,					{0x807F,0,}},			//以上数据项集合
	{0xE0000D20,					0,					0,					0,					0,					{0x8080,0,}},			//功率控制系列3,时段数
	{0xE0000D21,					0,					0,					0,					0,					{0x8081,0,}},			//功率控制系列3,时段1
	{0xE0000D22,					0,					0,					0,					0,					{0x8082,0,}},			//功率控制系列3,时段2
	{0xE0000D23,					0,					0,					0,					0,					{0x8083,0,}},			//功率控制系列3,时段3
	{0xE0000D24,					0,					0,					0,					0,					{0x8084,0,}},			//功率控制系列3,时段4
	{0xE0000D25,					0,					0,					0,					0,					{0x8085,0,}},			//功率控制系列3,时段5
	{0xE0000D26,					0,					0,					0,					0,					{0x8086,0,}},			//功率控制系列3,时段6
	{0xE0000D27,					0,					0,					0,					0,					{0x8087,0,}},			//功率控制系列3,时段7
	{0xE0000D28,					0,					0,					0,					0,					{0x8088,0,}},			//功率控制系列3,时段8
	{0xE0000D29,					0,					0,					0,					0,					{0x8089,0,}},			//功率控制系列3,执行时间
	{0xE0000D2F,					0,					0,					0,					0,					{0x808F,0,}},			//以上数据项集合
	{0xE0000D30,					0,					0,					0,					0,					{0x8090,0,}},			//功率控制系列4,时段数
	{0xE0000D31,					0,					0,					0,					0,					{0x8091,0,}},			//功率控制系列4,时段1
	{0xE0000D32,					0,					0,					0,					0,					{0x8092,0,}},			//功率控制系列4,时段2
	{0xE0000D33,					0,					0,					0,					0,					{0x8093,0,}},			//功率控制系列4,时段3
	{0xE0000D34,					0,					0,					0,					0,					{0x8094,0,}},			//功率控制系列4,时段4
	{0xE0000D35,					0,					0,					0,					0,					{0x8095,0,}},			//功率控制系列4,时段5
	{0xE0000D36,					0,					0,					0,					0,					{0x8096,0,}},			//功率控制系列4,时段6
	{0xE0000D37,					0,					0,					0,					0,					{0x8097,0,}},			//功率控制系列4,时段7
	{0xE0000D38,					0,					0,					0,					0,					{0x8098,0,}},			//功率控制系列4,时段8
	{0xE0000D39,					0,					0,					0,					0,					{0x8099,0,}},			//功率控制系列3,执行时间
	{0xE0000D3F,					0,					0,					0,					0,					{0x809F,0,}},			//以上数据项集合
	{0xE0000E00,					0,					0,					0,					0,					{0x80A4,0,}},			//月电量控制,月电量限额
	{0xE0000E01,					0,					0,					0,					0,					{0x80A5,0,}},			//月电量控制,轮次电量
	{0xE0000E02,					0,					0,					0,					0,					{0x80A6,0,}},			//购电量控制,本次购电量
	{0xE0000E03,					0,					0,					0,					0,					{0x80A7,0,}},			//购电量控制,剩余电量
	{0xE0000E04,					0,					0,					0,					0,					{0x80A8,0,}},			//终端电能量费率时段和费率数	(旧协议里没有,需另外扩充ID支持)
	{0xE0000E10,					0,					0,					0,					0,					{0x80A9,0,}},			//厂休控是否投入				(旧协议里没有,需另外扩充ID支持)
	{0xE0000E11,					0,					0,					0,					0,					{0x80AA,0,}},			//厂休控参数					(旧协议里没有,需另外扩充ID支持)
	{0xE0800000,					0,					0,					0,					0,					{0x8900,0,}},			//测量点的状态
	{0xE0800001,					0,					0,					0,					0,					{0x8901,0,}},			//测量点性质
	{0xE0800002,					0,					0,					0,					0,					{0x8902,0,}},			//测量点地址
	{0xE0800003,					0,					0,					0,					0,					{0x8903,0,}},			//测量点通信规约
	{0xE0800004,					0,					0,					0,					0,					{0x8904,0,}},			//电能表类型			(旧协议里没有,需另外扩充ID支持)
	{0xE0800005,					0,					0,					0,					0,					{0x8905,0,}},			//总分类型				(旧协议里没有,需另外扩充ID支持)
	{0xE0800006,					0,					0,					0,					0,					{0x8906,0,}},			//重点用户属性			(旧协议里没有,需另外扩充ID支持)
	{0xE0800007,					0,					0,					0,					0,					{0x8907,0,}},			//拉闸功能				(旧协议里没有,需另外扩充ID支持)
	{0xE0800008,					0,					0,					0,					0,					{0x8908,0,}},			//最大费率数			(旧协议里没有,需另外扩充ID支持)
	{0xE0800009,					0,					0,					0,					0,					{0x8909,0,}},			//测量点对应采集终端地址(旧协议里没有,需另外扩充ID支持)
	{0xE080000A,					0,					0,					0,					0,					{0x890a,0,}},			//测量点端口号
	{0xE080000B,					0,					0,					0,					0,					{0x890b,0,}},			//端口参数(波特率,校验位,数据位,停止位)   (旧协议里只支持波特率1字节,新协议支持波特率,校验位,数据位,停止位总共4字节,需调整旧ID字节数)
	{0xE080000C,					0,					0,					0,					0,					{0x890c,0,}},			//CT变比
	{0xE080000D,					0,					0,					0,					0,					{0x890d,0,}},			//PT变比
	{0xE080000F,					0,					0,					0,					0,					{0x890F,0,}},			//以上数据项集合
	{0xE0800010,					0,					0,					0,					0,					{0x8910,0,}},			//测量点接线方式
	{0xE0800011,					0,					0,					0,					0,					{0x8911,0,}},			//额定电压
	{0xE0800012,					0,					0,					0,					0,					{0x8912,0,}},			//额定电流
	{0xE0800013,					0,					0,					0,					0,					{0x8913,0,}},			//用户申报容量
	{0xE0800014,					0,					0,					0,					0,					{0x8914,0,}},			//变压器容量
	{0xE080001F,					0,					0,					0,					0,					{0x891F,0,}},			//以上数据项集合
	{0xE0800021,					0,					0,					0,					0,					{0x8930,0,}},				//电能表通信密码		
	{0xE0800022,					0,					0,					0,					0,					{0x8931,0,}},				//电能表通信用户名		
	{0xE080002F,					0,					0,					0,					0,					{0x893F,0,}},				//以上数据项集合		
	{0xE0800100,					0,					0,					0,					0,					{0x8921,0,}},				//电流不平衡度阈值
	{0xE0800101,					0,					0,					0,					0,					{0x8922,0,}},				//电流不平衡恢复阈值
	{0xE0800102,					0,					0,					0,					0,					{0x8923,0,}},				//合格电压上限
	{0xE0800103,					0,					0,					0,					0,					{0x8924,0,}},				//合格电压下限
	{0xE0800104,					0,					0,					0,					0,					{0x8925,0,}},				//判断电流过流的相对额定值	
	{0xE0800105,					0,					0,					0,					0,					{0x8926,0,}},				//判断负荷过载的相对额定值
	{0xE0800106,					0,					0,					0,					0,					{0x8927,0,}},				//判断负荷过载恢复的相对额定值
	{0xE0800107,					0,					0,					0,					0,					{0x8928,0,}},				//零相电流报警阈值				(旧协议里没有,需另外扩充ID支持)
	{0xE0800108,					0,					0,					0,					0,					{0x8929,0,}},				//零相电流报警恢复阈值			(旧协议里没有,需另外扩充ID支持)
	{0xE0800109,					0,					0,					0,					0,					{0x892a,0,}},				//判断电流过负荷恢复的相对额定值
	{0xE080010A,					0,					0,					0,					0,					{0x892b,0,}},				//电压不平衡阈值				(旧协议里没有,需另外扩充ID支持)
	{0xE080010B,					0,					0,					0,					0,					{0x892c,0,}},				//电压不平衡恢复阈值			(旧协议里没有,需另外扩充ID支持)
	{0xE080010C,					0,					0,					0,					0,					{0x892d,0,}},				//失压或断相报警的判断阈值		(旧协议里没有,需另外扩充ID支持)
	{0xE080010F,					0,					0,					0,					0,					{0x892F,0,}},				//以上数据项集合	
	{0xE0800200,					0,					0,					0,					0,					{0x8951,0,}},				//电压畸变率阈值				
	{0xE0800201,					0,					0,					0,					0,					{0x8952,0,}},				//电流畸变率阈值				
	{0xE0800202,					0,					0,					0,					0,					{0x8953,0,}},				//电压畸变报警恢复阀值阀值			
	{0xE0800203,					0,					0,					0,					0,					{0x8954,0,}},				//电流畸变报警恢复阀值阀值		
	{0xE0800204,					0,					0,					0,					0,					{0x8955,0,}},					//功率因数区段数				(旧协议里没有,需另外扩充ID支持)				
	{0xE0800205,					0,					0,					0,					0,					{0x8956,0,}},					//功率因数区段					(旧协议里没有,需另外扩充ID支持)
	{0xE0800206,					0,					0,					0,					0,					{0x8957,0,}},					//监测谐波次数					(旧协议里没有,需另外扩充ID支持)			
	{0xE0800207,					0,					0,					0,					0,					{0x8958,0,}},					//电压偏差上限					(旧协议里没有,需另外扩充ID支持)
	{0xE0800208,					0,					0,					0,					0,					{0x8959,0,}},					//电压偏差下限					(旧协议里没有,需另外扩充ID支持)	
	{0xE0800209,					0,					0,					0,					0,					{0x895a,0,}},					//频率偏差上限					(旧协议里没有,需另外扩充ID支持)
	{0xE080020A,					0,					0,					0,					0,					{0x895b,0,}},					//频率偏差下限					(旧协议里没有,需另外扩充ID支持)
	{0xE080020B,					0,					0,					0,					0,					{0x895c,0,}},					//电压长闪限值					(旧协议里没有,需另外扩充ID支持)
	{0xE080020C,					0,					0,					0,					0,					{0x895d,0,}},					//电压短闪限值					(旧协议里没有,需另外扩充ID支持)
	{0xE080020D,					0,					0,					0,					0,					{0x8854,0,}},					//无功过/欠补功率因素阀值
	{0xE080020E,					0,					0,					0,					0,					{0x8855,0,}},					//无功过/欠补功率因素恢复阀值
	{0xe1000001,					0,					0,					0,					0,					{0x2041,0,}},					//有功电能表起始读数
	{0xe1000002,					0,					0,					0,					0,					{0x2042,0,}},					//无功电能表起始读数
	{0xe1000003,					0,					0,					0,					0,					{0xc030,0,}},					//电表常数(有功)
	{0xe1000004,					0,					0,					0,					0,					{0xc031,0,}},					//电表常数(无功)
	{0xe1000008,					0,					0,					0,					0,					{0xc9b0,0,}},					//剩余金额
	{0xe1000010,					0,					0,					0,					0,					{0x2100,0,}},					//本日电压合格率统计数据
	{0xe1000011,					0,					0,					0,					0,					{0x2101,0,}},					//本日A相电压合格率统计数据
	{0xe1000012,					0,					0,					0,					0,					{0x2102,0,}},					//本日B相电压合格率统计数据
	{0xe1000013,					0,					0,					0,					0,					{0x2103,0,}},					//本日C相电压合格率统计数据
	{0xe1000014,					0,					0,					0,					0,					{0x2104,0,}},					//本日A相电流极值统计数据
	{0xe1000015,					0,					0,					0,					0,					{0x2105,0,}},					//本日B相电流极值统计数据
	{0xe1000016,					0,					0,					0,					0,					{0x2106,0,}},					//本日C相电流极值统计数据
	{0xe1000017,					0,					0,					0,					0,					{0x2107,0,}},					//本日零序电流极值统计数据
	{0xe1000018,					0,					0,					0,					0,					{0x2108,0,}},					//本日有功功率极值统计数据
	{0xe1000019,					0,					0,					0,					0,					{0x2109,0,}},					//本日无功功率极值统计数据
	{0xe100001a,					0,					0,					0,					0,					{0x210a,0,}},					//本日功率因素极值统计数据
	{0xe100001b,					0,					0,					0,					0,					{0x210b,0,}},					//本日电流不平衡越限统计数据
	{0xe100001c,					0,					0,					0,					0,					{0x210c,0,}},					//本日电压不平衡越限统计数据
	{0xe1000020,					0,					0,					0,					0,					{0x2110,0,}},					//本日日停电总次数
	{0xe1000021,					0,					0,					0,					0,					{0x2111,0,}},					//本日日停电总时间
	{0xe1000030,					0,					0,					0,					0,					{0x2112,0,}},					//本日断相数据
	{0xe1000031,					0,					0,					0,					0,					{0x2113,0,}},					//本日失压数据
	{0xe1000032,					0,					0,					0,					0,					{0x2114,0,}},					//本日失流数据
	{0xe1000033,					0,					0,					0,					0,					{0x2115,0,}},					//本日功率因素区段统计数据
	{0xe1000034,					0,					0,					0,					0,					{0x2116,0,}},					//本日A相功率因素区段统计数据
	{0xe1000035,					0,					0,					0,					0,					{0x2117,0,}},					//本日B相功率因素区段统计数据
	{0xe1000036,					0,					0,					0,					0,					{0x2118,0,}},					//本日C相功率因素区段统计数据
	{0xe1000040,					0,					0,					0,					0,					{0x2043,0,}},					//A相电压波动值
	{0xe1000041,					0,					0,					0,					0,					{0x2044,0,}},					//B相电压波动值
	{0xe1000042,					0,					0,					0,					0,					{0x2045,0,}},					//C相电压波动值
	{0xe1000043,					0,					0,					0,					0,					{0x2046,0,}},					//A相电压闪变值
	{0xe1000044,					0,					0,					0,					0,					{0x2047,0,}},					//B相电压闪变值
	{0xe1000045,					0,					0,					0,					0,					{0x2048,0,}},					//C相电压闪变值
	{0xe10001ff,					0,			T_BLK,				N_16,				C_03,					{0x205f,0x206f,0,}},	//本日最大值数据块
	{0xe10002ff,					0,			T_BLK,				N_16,				C_03,					{0x207f,0x208f,0,}},	//本日最小值数据块             					  					  					  					  				
	{0xe10003ff,					0,			T_BLK,				N_16,				C_03,					{0x209f,0x20af,0,}},	//本日平均值数据块
	{0xe1004014,					0,					0,					0,					0,					{0x2204,0,}},					//本月A相电流极值统计数据
	{0xe1004015,					0,					0,					0,					0,					{0x2205,0,}},					//本月B相电流极值统计数据
	{0xe1004016,					0,					0,					0,					0,					{0x2206,0,}},					//本月C相电流极值统计数据
	{0xe1004017,					0,					0,					0,					0,					{0x2207,0,}},					//本月零序电流极值统计数据
	{0xe1004018,					0,					0,					0,					0,					{0x2208,0,}},					//本月有功功率极值统计数据
	{0xe1004019,					0,					0,					0,					0,					{0x2209,0,}},					//本月无功功率极值统计数据
	{0xe100401a,					0,					0,					0,					0,					{0x220a,0,}},					//本月功率因素极值统计数据
	{0xe100401b,					0,					0,					0,					0,					{0x220b,0,}},					//本月电流不平衡度越限统计数据
	{0xe100401c,					0,					0,					0,					0,					{0x220c,0,}},					//本月电压不平衡度越限统计数据
	{0xe1004020,					0,					0,					0,					0,					{0x2210,0,}},					//本月停电总次数
	{0xe1004021,					0,					0,					0,					0,					{0x2211,0,}},					//本月停电总时间
	{0xe1004030,					0,					0,					0,					0,					{0x2212,0,}},					//本月断相数据
	{0xe1004031,					0,					0,					0,					0,					{0x2213,0,}},					//本月失压数据
	{0xe1004032,					0,					0,					0,					0,					{0x2214,0,}},					//本月失流数据
	{0xe1004033,					0,					0,					0,					0,					{0x2215,0,}},					//本月功率因素区段统计数据
	{0xe1004034,					0,					0,					0,					0,					{0x2216,0,}},					//本月A相功率因素区段统计数据
	{0xe1004035,					0,					0,					0,					0,					{0x2217,0,}},					//本月B相功率因素区段统计数据
	{0xe1004036,					0,					0,					0,					0,					{0x2218,0,}},					//本月C相功率因素区段统计数据
	{0xe1008010,					0,					0,					0,					0,					{0x2100,0,}},						//日电压合格率统计数据
	{0xe1008011,					0,					0,					0,					0,					{0x2101,0,}},						//日A相电压合格率统计数据
	{0xe1008012,					0,					0,					0,					0,					{0x2102,0,}},						//日B相电压合格率统计数据
	{0xe1008013,					0,					0,					0,					0,					{0x2103,0,}},						//日C相电压合格率统计数据
	{0xe1008014,					0,					0,					0,					0,					{0x2504,0,}},						//日频率合格率统计数据
	{0xe1008015,					0,					0,					0,					0,					{0x2505,0,}},						//日A相电流极值统计数据
	{0xe1008016,					0,					0,					0,					0,					{0x2506,0,}},						//日B相电流极值统计数据
	{0xe1008017,					0,					0,					0,					0,					{0x2507,0,}},						//日C相电流极值统计数据
	{0xe1008018,					0,					0,					0,					0,					{0x2508,0,}},						//日有功功率极值统计数据
	{0xe1008019,					0,					0,					0,					0,					{0x2509,0,}},						//日无功功率极值统计数据
	{0xe100801a,					0,					0,					0,					0,					{0x250a,0,}},						//日功率因素极值统计数据
	{0xe100801b,					0,					0,					0,					0,					{0x250b,0,}},						//日正序电流极值统计数据
	{0xe100801c,					0,					0,					0,					0,					{0x250c,0,}},						//日负序电流极值统计数据
	{0xe100801d,					0,					0,					0,					0,					{0x250d,0,}},						//日零序电流极值统计数据
	{0xe1008020,					0,					0,					0,					0,					{0x2510,0,}},						//日电流不平衡度越限统计数据
	{0xe1008021,					0,					0,					0,					0,					{0x2511,0,}},						//日电压不平衡度合格率统计数据
	{0xe1008022,					0,					0,					0,					0,					{0x2512,0,}},						//日A相电压闪变合格率统计数据
	{0xe1008023,					0,					0,					0,					0,					{0x2513,0,}},						//日B相电压闪变合格率统计数据
	{0xe1008024,					0,					0,					0,					0,					{0x2514,0,}},						//日C相电压闪变合格率统计数据
	{0xe1008025,					0,					0,					0,					0,					{0x2515,0,}},						//日A相电压总畸变合格率统计数据
	{0xe1008026,					0,					0,					0,					0,					{0x2516,0,}},						//日B相电压总畸变合格率统计数据
	{0xe1008027,					0,					0,					0,					0,					{0x2517,0,}},						//日C相电压总畸变合格率统计数据
	{0xe1008028,					0,					0,					0,					0,					{0x2518,0,}},						//日A相电压波动数据
	{0xe1008029,					0,					0,					0,					0,					{0x2519,0,}},						//日B相电压波动数据
	{0xe100802a,					0,					0,					0,					0,					{0x251a,0,}},						//日C相电压波动数据
	{0xe1008030,					0,					0,					0,					0,					{0x2520,0,}},						//日停电总次数
	{0xe1008031,					0,					0,					0,					0,					{0x2521,0,}},						//日停电总时间
	{0xe1008040,					0,					0,					0,					0,					{0x2522,0,}},						//日断相数据
	{0xe1008041,					0,					0,					0,					0,					{0x2523,0,}},						//日失压数据
	{0xe1008042,					0,					0,					0,					0,					{0x2524,0,}},						//日失流数据
	{0xe1008043,					0,					0,					0,					0,					{0x2526,0,}},						//日功率因素区段统计数据
	{0xe1008044,					0,					0,					0,					0,					{0x2527,0,}},						//日A相功率因素区段统计数据
	{0xe1008045,					0,					0,					0,					0,					{0x2528,0,}},						//日B相功率因素区段统计数据
	{0xe1008046,					0,					0,					0,					0,					{0x2529,0,}},						//日C相功率因素区段统计数据
	{0xe10081ff,					0,			T_BLK,				N_21,				C_02,					{0x271f,0,}},						//日A相电压谐波含有量最大值数据块
	{0xe10082ff,					0,			T_BLK,				N_21,				C_02,					{0x272f,0,}},						//日B相电压谐波含有量最大值数据块
	{0xe10083ff,					0,			T_BLK,				N_21,				C_02,					{0x273f,0,}},						//日C相电压谐波含有量最大值数据块
	{0xe10084ff,					0,			T_BLK,				N_21,				C_02,					{0x274f,0,}},						//日A相电流谐波含有量最大值数据块
	{0xe10085ff,					0,			T_BLK,				N_21,				C_02,					{0x275f,0,}},						//日B相电流谐波含有量最大值数据块
	{0xe10086ff,					0,			T_BLK,				N_21,				C_02,					{0x276f,0,}},						//日C相电流谐波含有量最大值数据块
	{0xe10087ff,					0,			T_BLK,				N_21,				C_02,					{0x277f,0,}},						//日A相电压谐波含有量最小值数据块
	{0xe10088ff,					0,			T_BLK,				N_21,				C_02,					{0x278f,0,}},						//日B相电压谐波含有量最小值数据块
	{0xe10089ff,					0,			T_BLK,				N_21,				C_02,					{0x279f,0,}},						//日C相电压谐波含有量最小值数据块
	{0xe1008aff,					0,			T_BLK,				N_21,				C_02,					{0x27af,0,}},						//日A相电流谐波含有量最小值数据块
	{0xe1008bff,					0,			T_BLK,				N_21,				C_02,					{0x27bf,0,}},						//日B相电流谐波含有量最小值数据块
	{0xe1008cff,					0,			T_BLK,				N_21,				C_02,					{0x27cf,0,}},						//日C相电流谐波含有量最小值数据块
	{0xe10090ff,					0,			T_BLK,				N_21,				C_02,					{0x291f,0,}},						//日A相电压谐波含有量平均值数据块
	{0xe10091ff,					0,			T_BLK,				N_21,				C_02,					{0x292f,0,}},						//日B相电压谐波含有量平均值数据块
	{0xe10092ff,					0,			T_BLK,				N_21,				C_02,					{0x293f,0,}},						//日C相电压谐波含有量平均值数据块
	{0xe10093ff,					0,			T_BLK,				N_21,				C_02,					{0x294f,0,}},						//日A相电流谐波含有量平均值数据块
	{0xe10094ff,					0,			T_BLK,				N_21,				C_02,					{0x295f,0,}},						//日B相电流谐波含有量平均值数据块
	{0xe10095ff,					0,			T_BLK,				N_21,				C_02,					{0x296f,0,}},						//日C相电流谐波含有量平均值数据块
	{0xe10096ff,					0,			T_BLK,				N_21,				C_02,					{0x297f,0,}},						//日A相电压谐波含有量95%值数据块
	{0xe10097ff,					0,			T_BLK,				N_21,				C_02,					{0x298f,0,}},						//日B相电压谐波含有量95%值数据块
	{0xe10098ff,					0,			T_BLK,				N_21,				C_02,					{0x299f,0,}},						//日C相电压谐波含有量95%值数据块
	{0xe10099ff,					0,			T_BLK,				N_21,				C_02,					{0x29af,0,}},						//日A相电流谐波含有量95%值数据块
	{0xe1009aff,					0,			T_BLK,				N_21,				C_02,					{0x29bf,0,}},						//日B相电流谐波含有量95%值数据块
	{0xe1009bff,					0,			T_BLK,				N_21,				C_02,					{0x29cf,0,}},						//日C相电流谐波含有量95%值数据块
	{0xe1009c00,					0,					0,					0,					0,					{0x2300,0,}},						//日第1组电容器累计投入时间
	{0xe1009c01,					0,					0,					0,					0,					{0x2301,0,}},						//日第2组电容器累计投入时间
	{0xe1009c02,					0,					0,					0,					0,					{0x2302,0,}},						//日第3组电容器累计投入时间
	{0xe1009c03,					0,					0,					0,					0,					{0x2303,0,}},						//日第4组电容器累计投入时间
	{0xe1009c04,					0,					0,					0,					0,					{0x2304,0,}},						//日第5组电容器累计投入时间
	{0xe1009c05,					0,					0,					0,					0,					{0x2305,0,}},						//日第6组电容器累计投入时间
	{0xe1009c06,					0,					0,					0,					0,					{0x2306,0,}},						//日第7组电容器累计投入时间
	{0xe1009c07,					0,					0,					0,					0,					{0x2307,0,}},						//日第8组电容器累计投入时间
	{0xe1009c08,					0,					0,					0,					0,					{0x2308,0,}},						//日第9组电容器累计投入时间
	{0xe1009c09,					0,					0,					0,					0,					{0x2309,0,}},						//日第10组电容器累计投入时间
	{0xe1009c0a,					0,					0,					0,					0,					{0x230a,0,}},						//日第11组电容器累计投入时间
	{0xe1009c0b,					0,					0,					0,					0,					{0x230b,0,}},						//日第12组电容器累计投入时间
	{0xe1009c0c,					0,					0,					0,					0,					{0x230c,0,}},						//日第13组电容器累计投入时间
	{0xe1009c0d,					0,					0,					0,					0,					{0x230d,0,}},						//日第14组电容器累计投入时间
	{0xe1009c0e,					0,					0,					0,					0,					{0x230e,0,}},						//日第15组电容器累计投入时间
	{0xe1009c0f,					0,					0,					0,					0,					{0x2310,0,}},						//日第16组电容器累计投入时间
	{0xe1009c10,					0,					0,					0,					0,					{0x2400,0,}},						//日第1组电容器累计投入次数
	{0xe1009c11,					0,					0,					0,					0,					{0x2401,0,}},						//日第2组电容器累计投入次数
	{0xe1009c12,					0,					0,					0,					0,					{0x2402,0,}},						//日第3组电容器累计投入次数
	{0xe1009c13,					0,					0,					0,					0,					{0x2403,0,}},						//日第4组电容器累计投入次数
	{0xe1009c14,					0,					0,					0,					0,					{0x2404,0,}},						//日第5组电容器累计投入次数
	{0xe1009c15,					0,					0,					0,					0,					{0x2405,0,}},						//日第6组电容器累计投入次数
	{0xe1009c16,					0,					0,					0,					0,					{0x2406,0,}},						//日第7组电容器累计投入次数
	{0xe1009c17,					0,					0,					0,					0,					{0x2407,0,}},						//日第8组电容器累计投入次数
	{0xe1009c18,					0,					0,					0,					0,					{0x2408,0,}},						//日第9组电容器累计投入次数
	{0xe1009c19,					0,					0,					0,					0,					{0x2409,0,}},						//日第10组电容器累计投入次数
	{0xe1009c1a,					0,					0,					0,					0,					{0x240a,0,}},						//日第11组电容器累计投入次数
	{0xe1009c1b,					0,					0,					0,					0,					{0x240b,0,}},						//日第12组电容器累计投入次数
	{0xe1009c1c,					0,					0,					0,					0,					{0x240c,0,}},						//日第13组电容器累计投入次数
	{0xe1009c1d,					0,					0,					0,					0,					{0x240d,0,}},						//日第14组电容器累计投入次数
	{0xe1009c1e,					0,					0,					0,					0,					{0x240e,0,}},						//日第15组电容器累计投入次数
	{0xe1009c1f,					0,					0,					0,					0,					{0x2410,0,}},						//日第16组电容器累计投入次数
	{0xe1009c20,					0,					0,					0,					0,					{0x2525,0,}},						//日补偿的无功电能量
	{0xe100c010,					0,					0,					0,					0,					{0x2200,0,}},						//月电压合格率统计数据
	{0xe100c011,					0,					0,					0,					0,					{0x2201,0,}},						//月A相电压合格率统计数据
	{0xe100c012,					0,					0,					0,					0,					{0x2202,0,}},						//月B相电压合格率统计数据
	{0xe100c013,					0,					0,					0,					0,					{0x2203,0,}},						//月C相电压合格率统计数据
	{0xe100c014,					0,					0,					0,					0,					{0x2604,0,}},						//月频率合格率统计数据
	{0xe100c015,					0,					0,					0,					0,					{0x2605,0,}},						//月A相电流极值统计数据
	{0xe100c016,					0,					0,					0,					0,					{0x2606,0,}},						//月B相电流极值统计数据
	{0xe100c017,					0,					0,					0,					0,					{0x2607,0,}},						//月C相电流极值统计数据
	{0xe100c018,					0,					0,					0,					0,					{0x2608,0,}},						//月有功功率极值统计数据
	{0xe100c019,					0,					0,					0,					0,					{0x2609,0,}},						//月无功功率极值统计数据
	{0xe100c01a,					0,					0,					0,					0,					{0x260a,0,}},						//月功率因素极值统计数据
	{0xe100c01b,					0,					0,					0,					0,					{0x260b,0,}},						//月正序电流极值统计数据
	{0xe100c01c,					0,					0,					0,					0,					{0x260c,0,}},						//月负序电流极值统计数据
	{0xe100c01d,					0,					0,					0,					0,					{0x260d,0,}},						//月零序电流极值统计数据
	{0xe100c020,					0,					0,					0,					0,					{0x2610,0,}},						//月电流不平衡度越限统计数据
	{0xe100c021,					0,					0,					0,					0,					{0x2611,0,}},						//月电压不平衡度合格率统计数据
	{0xe100c022,					0,					0,					0,					0,					{0x2612,0,}},						//月A相电压闪变合格率统计数据
	{0xe100c023,					0,					0,					0,					0,					{0x2613,0,}},						//月B相电压闪变合格率统计数据
	{0xe100c024,					0,					0,					0,					0,					{0x2614,0,}},						//月C相电压闪变合格率统计数据
	{0xe100c025,					0,					0,					0,					0,					{0x2615,0,}},						//月A相电压总畸变合格率统计数据
	{0xe100c026,					0,					0,					0,					0,					{0x2616,0,}},						//月B相电压总畸变合格率统计数据
	{0xe100c027,					0,					0,					0,					0,					{0x2617,0,}},						//月C相电压总畸变合格率统计数据
	{0xe100c028,					0,					0,					0,					0,					{0x2618,0,}},						//月A相电压波动数据
	{0xe100c029,					0,					0,					0,					0,					{0x2619,0,}},						//月B相电压波动数据
	{0xe100c02a,					0,					0,					0,					0,					{0x261a,0,}},						//月C相电压波动数据
	{0xe100c030,					0,					0,					0,					0,					{0x2620,0,}},						//月停电总次数
	{0xe100c031,					0,					0,					0,					0,					{0x2621,0,}},						//月停电总时间
	{0xe100c040,					0,					0,					0,					0,					{0x2622,0,}},						//月断相数据
	{0xe100c041,					0,					0,					0,					0,					{0x2623,0,}},						//月失压数据
	{0xe100c042,					0,					0,					0,					0,					{0x2624,0,}},						//月失流数据
	{0xe100c043,					0,					0,					0,					0,					{0x2626,0,}},						//月功率因素区段统计数据
	{0xe100c044,					0,					0,					0,					0,					{0x2627,0,}},						//月A相功率因素区段统计数据
	{0xe100c045,					0,					0,					0,					0,					{0x2628,0,}},						//月B相功率因素区段统计数据
	{0xe100c046,					0,					0,					0,					0,					{0x2629,0,}},						//月C相功率因素区段统计数据
	{0xe100c1ff,					0,			T_BLK,				N_21,				C_02,					{0x281f,0,}},						//月A相电压谐波含有量最大值数据块
	{0xe100c2ff,					0,			T_BLK,				N_21,				C_02,					{0x282f,0,}},						//月B相电压谐波含有量最大值数据块
	{0xe100c3ff,					0,			T_BLK,				N_21,				C_02,					{0x283f,0,}},						//月C相电压谐波含有量最大值数据块
	{0xe100c4ff,					0,			T_BLK,				N_21,				C_02,					{0x284f,0,}},						//月A相电流谐波含有量最大值数据块
	{0xe100c5ff,					0,			T_BLK,				N_21,				C_02,					{0x285f,0,}},						//月B相电流谐波含有量最大值数据块
	{0xe100c6ff,					0,			T_BLK,				N_21,				C_02,					{0x286f,0,}},						//月C相电流谐波含有量最大值数据块
	{0xe100c7ff,					0,			T_BLK,				N_21,				C_02,					{0x287f,0,}},						//月A相电压谐波含有量最小值数据块
	{0xe100c8ff,					0,			T_BLK,				N_21,				C_02,					{0x288f,0,}},						//月B相电压谐波含有量最小值数据块
	{0xe100c9ff,					0,			T_BLK,				N_21,				C_02,					{0x289f,0,}},						//月C相电压谐波含有量最小值数据块
	{0xe100caff,					0,			T_BLK,				N_21,				C_02,					{0x28af,0,}},						//月A相电流谐波含有量最小值数据块
	{0xe100cbff,					0,			T_BLK,				N_21,				C_02,					{0x28bf,0,}},						//月B相电流谐波含有量最小值数据块
	{0xe100ccff,					0,			T_BLK,				N_21,				C_02,					{0x28cf,0,}},						//月C相电流谐波含有量最小值数据块
	{0xe100d0ff,					0,			T_BLK,				N_21,				C_02,					{0x2a1f,0,}},						//月A相电压谐波含有量平均值数据块
	{0xe100d1ff,					0,			T_BLK,				N_21,				C_02,					{0x2a2f,0,}},						//月B相电压谐波含有量平均值数据块
	{0xe100d2ff,					0,			T_BLK,				N_21,				C_02,					{0x2a3f,0,}},						//月C相电压谐波含有量平均值数据块
	{0xe100d3ff,					0,			T_BLK,				N_21,				C_02,					{0x2a4f,0,}},						//月A相电流谐波含有量平均值数据块
	{0xe100d4ff,					0,			T_BLK,				N_21,				C_02,					{0x2a5f,0,}},						//月B相电流谐波含有量平均值数据块
	{0xe100d5ff,					0,			T_BLK,				N_21,				C_02,					{0x2a6f,0,}},						//月C相电流谐波含有量平均值数据块
	{0xe100d6ff,					0,			T_BLK,				N_21,				C_02,					{0x2a7f,0,}},						//月A相电压谐波含有量95%值数据块
	{0xe100d7ff,					0,			T_BLK,				N_21,				C_02,					{0x2a8f,0,}},						//月B相电压谐波含有量95%值数据块
	{0xe100d8ff,					0,			T_BLK,				N_21,				C_02,					{0x2a9f,0,}},						//月C相电压谐波含有量95%值数据块
	{0xe100d9ff,					0,			T_BLK,				N_21,				C_02,					{0x2aaf,0,}},						//月A相电流谐波含有量95%值数据块
	{0xe100daff,					0,			T_BLK,				N_21,				C_02,					{0x2abf,0,}},						//月B相电流谐波含有量95%值数据块
	{0xe100db20,					0,					0,					0,					0,					{0x2625,0,}},						//月补偿的无功电能量
	{0xe100dbff,					0,			T_BLK,				N_21,				C_02,					{0x2acf,0,}},						//月C相电流谐波含有量95%值数据块
	{0xE1800001,					0,					0,					0,					0,					{0x8860,0,}},				//终端状态字
	{0xE1800002,					0,					0,					0,					0,					{0x8861,0,}},				//最大脉冲量路数
	{0xE1800003,					0,					0,					0,					0,					{0x8862,0,}},				//串行通信端口数据
	{0xE1800004,					0,					0,					0,					0,					{0x8863,0,}},				//支持最大测量点数
	{0xE1800005,					0,					0,					0,					0,					{0x8864,0,}},				//测量点总数
	{0xE1800006,					0,					0,					0,					0,					{0x8865,0,}},				//终端普通用户表总数
	{0xE1800007,					0,					0,					0,					0,					{0x8866,0,}},				//终端多功能表总数
	{0xE1800008,					0,					0,					0,					0,					{0x8867,0,}},				//终端重点户电能表总数
	{0xE1800009,					0,					0,					0,					0,					{0x8868,0,}},				//终端抄表状态信息
	{0xE1800010,					0,					0,					0,					0,					{0x8869,0,}},				//本日线损率
	{0xE1800011,					0,					0,					0,					0,					{0x886a,0,}},				//当前日通信流量
	{0xE1800012,					0,					0,					0,					0,					{0x886b,0,}},				//冻结日通信流量
	{0xE1800013,					0,					0,					0,					0,					{0x886c,0,}},				//当前月通信流量
	{0xE1800014,					0,					0,					0,					0,					{0x886d,0,}},				//冻结月通信流量
	{0xE1800015,					0,					0,					0,					0,					{0x886e,0,}},				//信号强度
	{0xE1800016,					0,					0,					0,					0,					{0x8870,0,}},				//当前月终端复位次数
	{0xE1800017,					0,					0,					0,					0,					{0x8871,0,}},				//冻结月终端复位次数
	{0xE1800018,					0,					0,					0,					0,					{0x8872,0,}},				//载波模块程序版本号
	{0xE1800020,					0,					0,					0,					0,					{0x8874,0,}},				//重点户电能表测量点号
};



#define PROID2SUB_NUM	(sizeof(g_ProId2Sub)/sizeof(g_ProId2Sub[0]))


const TProId2Sub* BinarySearchProIdTab(const TProId2Sub* pProId2Sub, WORD num, DWORD dwID)
{
	int little, big, mid;
	if (dwID<pProId2Sub[0].dwID  || dwID>pProId2Sub[num-1].dwID)
		return NULL;

	little = 0;
	big = num;
	while (little <= big)
	{                               
		mid = (little + big) / 2;       //二分

		if (pProId2Sub[mid].dwID == dwID) 
		{
			return pProId2Sub + mid;
		}
		else if (dwID > pProId2Sub[mid].dwID)
		{
			little = mid + 1;
		} 
		else  
		{
			big = mid - 1;
		}

		mid = (little + big) / 2;
	}

	return NULL;
}

const TProId2Sub* BinarySearchProId(DWORD dwID)
{
	const TProId2Sub* pProId2Sub = NULL;
	pProId2Sub = BinarySearchProIdTab(g_ProId2Sub,PROID2SUB_NUM,dwID);
	if(pProId2Sub == NULL)
	{
			//根据id本身搜索未搜到,将DI0位改成0xff,搜索是否存在对应的块id
			pProId2Sub = BinarySearchProIdTab(g_ProId2Sub,PROID2SUB_NUM,dwID|0xff);
			if(pProId2Sub == NULL)
			{
				//在DI0位改成0xff未搜到块id,再将DI1位改成0xff,搜索是否存在对应的块id
				pProId2Sub = BinarySearchProIdTab(g_ProId2Sub,PROID2SUB_NUM,dwID|0xff00);
			}
	}
	return pProId2Sub;
}

WORD* ProId2SubId(DWORD dwID,WORD* pwSubNum)
{
	const TProId2Sub *pProId2Sub = NULL;
	*pwSubNum = 0;

	pProId2Sub = BinarySearchProIdTab(g_ProId2Sub,PROID2SUB_NUM,dwID);
	if(pProId2Sub != NULL)
	{
		//返回实际的ID个数
		int i = 0;
		while(i < SUB_ID_MAX && pProId2Sub->wSubId[i])
		{
			i++;
		}

		//*pwSubNum = sizeof(pProId2Sub->wSubId)/sizeof(pProId2Sub->wSubId[0]) - 1;
		*pwSubNum = i;

		return (WORD* )pProId2Sub->wSubId;
	}
	else
		return NULL;
}


WORD* ProId2RdId(DWORD dwID,WORD* pwSubNum)
{
	const TProId2Sub *pProId2Sub = NULL;
	*pwSubNum = 0;

	pProId2Sub = BinarySearchProIdTab(g_ProId2Sub,PROID2SUB_NUM,dwID);
	if(pProId2Sub != NULL)
	{
		//返回实际的ID个数
		int i = 0;
		while(i < SUB_ID_MAX && pProId2Sub->wSubId[i])
		{
			i++;
		}

		//*pwSubNum = sizeof(pProId2Sub->wSubId)/sizeof(pProId2Sub->wSubId[0]) - 1;
		*pwSubNum = i;

		if (!(pProId2Sub->bCode) )
			return (WORD* )pProId2Sub->wSubId;
		else		
			return (WORD* )(pProId2Sub->wSubId+1);
	}
	else
		return NULL;
}

bool InitProId2Sub()
{

	int i=0;
	//初始化g_ProId2Sub相关工作

	//上电时调整块ID包括的子ID个数
	for(i = 0; i < PROID2SUB_NUM; i++)
	{
		//验证ID顺序
		if(i > 0)
		{
			if((g_ProId2Sub[i-1].dwID > g_ProId2Sub[i].dwID))
			{
				DTRACE(DB_FAPROTO,("Init ProId2Sub g_ProId2Sub[%d].%08x > g_ProId2Sub[%d].%08x,id order occur err!",i-1,g_ProId2Sub[i-1].dwID,i,g_ProId2Sub[i].dwID));
			}
		}
		if(i < PROID2SUB_NUM-1)
		{
			if((g_ProId2Sub[i].dwID > g_ProId2Sub[i+1].dwID))
			{
				DTRACE(DB_FAPROTO,("Init ProId2Sub g_ProId2Sub[%d].%08x > g_ProId2Sub[%d].%08x,id order occur err!",i,g_ProId2Sub[i].dwID,i+1,g_ProId2Sub[i+1].dwID));
			}
		}
	}

	return true;
}

int WriteItemDw(WORD wBank, WORD wPn, DWORD dwID, BYTE* pbBuf, DWORD dwTime)
{
	WORD *pwSub = NULL;
	WORD wSubNum = 0;
	BYTE *pbData = pbBuf;
	int i=0, iTotalLen = 0;
	int iRet = 0;
	pwSub = ProId2SubId(dwID,&wSubNum);
	
	if(pwSub != NULL && wSubNum > 0)
	{
		WORD wId;
		for(i = 0; i < wSubNum; i++)
		{
			BYTE bModeTest = 0;
			ReadItemEx(BN1,PN0,0x2113,&bModeTest);

			wId = pwSub[i];
			if (BN0 == wBank && PN0 == wPn && wId >= 0x8010 && wId <= 0x802f)//通信参数只设置备份的
			{
				wId = pwSub[i]+0x0870;
			}

			if(0x01==bModeTest && wId==0x8017)//测试模式下, 心跳实时生效
				wId = pwSub[i];

			if((iRet=WriteItemTm(wBank,wPn,wId,pbData,dwTime)) > 0)
			{
				pbData += iRet;
				iTotalLen += iRet;
			}
			else
			{
				iTotalLen = -1;
				break;
			}
		}
	}
	return iTotalLen;
}

int PostReadItemDwHook(WORD wBank, WORD wPn, DWORD dwID, WORD *pwSub, WORD wSubNum, BYTE* pbData, DWORD dwStartTime, DWORD dwEndTime)
{
	BYTE bBuf[64];
	int iRet = 0;

	if (wBank==BN0 && (dwID==0x020a01ff || dwID==0x020a02ff || dwID==0x020a03ff || dwID==0x020b01ff || dwID==0x020b02ff || dwID==0x020b03ff))
	{//需要组合处理的ID，
		if (wSubNum < 2)
			iRet = -1;

		if (ReadItemTm(wBank,wPn,pwSub[0], &bBuf[0],dwStartTime,dwEndTime) != 2 ||
			ReadItemTm(wBank,wPn,pwSub[1], &bBuf[2],dwStartTime,dwEndTime) != 42 )
			return -2;
		
		memcpy(pbData, bBuf, 2);
		memcpy(pbData+2, &bBuf[4], 40);
		iRet = 42;
	}

	return iRet;
}

//单个ID按缓冲区的读
int ReadItemDw(WORD wBank, WORD wPn, DWORD dwID, BYTE* pbBuf, DWORD dwStartTime, DWORD dwEndTime)
{
	WORD *pwSub = NULL;
	WORD wSubNum = 0;
	BYTE bBuf[1024];
	BYTE *pbData = bBuf;
	int i=0, iTotalLen = 0;
	int iRet = 0;
	TProIdInfo ProIdInfo = {0}; //20140605-2

	memset(&ProIdInfo,0,sizeof(TProIdInfo));
	if(!GetProIdInfo(dwID, &ProIdInfo, false))
		return -1;

	pwSub = ProId2SubId(ProIdInfo.dwProId,&wSubNum);

	if(pwSub != NULL && wSubNum > 0)
	{
		//需要做一个特殊处理，对于某些南网协议ID和07-645ID不对应，需要对抄读的07-645ID组合处理
		iRet = PostReadItemDwHook(wBank, wPn, ProIdInfo.dwProId, pwSub, wSubNum, pbData, dwStartTime,dwEndTime);
		if (iRet > 0)
		{
			pbData += iRet;
			iTotalLen += iRet;
			if (ProIdInfo.wDataLen > GetItemLen(wBank,pwSub[0]))
				ProIdInfo.wDataLen -= GetItemLen(wBank,pwSub[0]);//20140320-1
			else
				ProIdInfo.wDataLen = 0;
		}
		else if (iRet == -2)	//确定是读不到了，不用多读一次
		{
			iTotalLen = -1;
		}
		else
		{
			for(i = 0; i < wSubNum; i++)
			{
				int irBitNum = 0;
				iRet = GetItemLen(wBank,pwSub[i]);
				if(wBank==BN0 && IsNorSuportId(pwSub[i]))//20140626-1
					irBitNum = ReadItemEx(wBank,wPn,pwSub[i],pbData);
				else
					irBitNum = ReadItemTm(wBank,wPn,pwSub[i],pbData,dwStartTime,dwEndTime);
				if(iRet>0 && irBitNum==iRet)
				{
					pbData += iRet;
					iTotalLen += iRet;
				}
				else
				{
					iTotalLen = -1;
					break;
				}
			}	
		}
		if(ProIdInfo.bIdx == INVALID_DATA && ProIdInfo.wOffset==0xFFFF) //子id超出目前块id所支持的范围,没赋正确的偏移默认成无效数据
			memset(pbBuf,INVALID_DATA,ProIdInfo.wDataLen);
		else
			memcpy(pbBuf,bBuf+ProIdInfo.wOffset,ProIdInfo.wDataLen);
	}
	return iTotalLen;
}

//多个ID的读接口,目前只支持按缓冲区的读
int ReadItemDwMid(WORD wBank, WORD wPn, DWORD *pdwID, WORD wNum, BYTE* pbBuf, DWORD dwStartTime, DWORD dwEndTime)
{
	
	BYTE *pbData = pbBuf;
	DWORD dwID = 0;
	int i=0, iTotalLen = 0;
	int iRet = 0;

	for (i=0; i<wNum; i++)
	{
		dwID = *pdwID++;

		iRet = GetItemLenDw(wBank, dwID);
		if (iRet > 0  && (ReadItemDw(wBank,wPn,dwID,pbData,dwStartTime,dwEndTime) == iRet))
		{	
			pbData += iRet;
			iTotalLen += iRet;
		}
		else
		{
			iTotalLen = -1;
			break;
		}
	}

	return iTotalLen;
}


int ReadItemDwMbi(TProItem* pProItem, WORD wNum, BYTE* pbBuf, DWORD dwStartTime, DWORD dwEndTime)
{
	BYTE *pbData = pbBuf;
	DWORD dwID = 0;
	int i=0, iTotalLen = 0;
	int iRet = 0;

	for (i=0; i<wNum; i++)
	{
		dwID = pProItem[i].dwID;

		iRet = GetItemLenDw(pProItem[i].wBn, dwID);
		if (iRet > 0  && (ReadItemDw(pProItem[i].wBn,pProItem[i].wPn,dwID,pbData,dwStartTime,dwEndTime) == iRet))
		{	
			pbData += iRet;
			iTotalLen += iRet;
		}
		else
		{
			iTotalLen = -1;
			break;
		}
	}
	return iTotalLen;
}

int GetItemLenDw(WORD wBn, DWORD dwID)
{
	//int iTotalLen = 0;
	//WORD *pwSub = NULL;
	//WORD wSubNum = 0;
	//int iRet = 0;

	//pwSub = ProId2SubId(dwID,&wSubNum);
	//if(pwSub != NULL && wSubNum > 0)
	//{
	//	for(int i = 0; i < wSubNum; i++)
	//	{
	//		iRet = GetItemLen(wBn,pwSub[i]);
	//		if(iRet > 0)
	//		{
	//			iTotalLen += iRet;
	//		}
	//		else
	//		{
	//			iTotalLen = -1;
	//			break;
	//		}
	//	}
	//	
	//}

	//return iTotalLen;
	TProIdInfo ProIdInfo;
	int iTotalLen = 0;
	if(GetProIdInfo(dwID,&ProIdInfo,false))
	{
		iTotalLen = ProIdInfo.wDataLen;
	}
	else
	{
		iTotalLen = -1;
	}
	return iTotalLen;
}

int GetItemsLenDw(DWORD *pdwItemID, WORD wNum)
{
	int i=0, iTotalLen = 0, iRet=0;
	DWORD dwID = 0;
	for (i=0; i<wNum; i++)
	{
		dwID = *pdwItemID++;
		
		iRet = GetItemLenDw(BN0, dwID);
		if (iRet > 0)
		{	
			iTotalLen += iRet;
		}
		else
		{
			iTotalLen = -1;
			break;
		}
	}

	return iTotalLen;
}


int GetExistItemLenDw(WORD wBn, DWORD dwID)
{
	int i=0, iTotalLen = 0;
	WORD *pwSub = NULL;
	WORD wSubNum = 0;
	int iRet = 0;

	pwSub = ProId2SubId(dwID,&wSubNum);
	if(pwSub != NULL && wSubNum > 0)
	{
		for(i = 0; i < wSubNum; i++)
		{
			iRet = GetItemLen(wBn,pwSub[i]);
			if(iRet > 0)
			{
				iTotalLen += iRet;
			}
			else
			{
				iTotalLen = -1;
				break;
			}
		}

	}

	return iTotalLen;
}


int GetExistItemsLenDw(const DWORD *pdwItemID, WORD wNum)
{
	int i=0, iTotalLen = 0, iRet=0;
	DWORD dwID = 0;
	for (i=0; i<wNum; i++)
	{
		dwID = *pdwItemID++;

		iRet = GetExistItemLenDw(BN0, dwID);
		if (iRet > 0)
		{	
			iTotalLen += iRet;
		}
		else
		{
			iTotalLen = -1;
			break;
		}
	}

	return iTotalLen;
}

//数据项时间的查询,看数据项是否再指定时间内更新了
int QueryItemTimeDwMbi(DWORD dwStartTime, DWORD dwEndTime, TProItem* pProItem, WORD wNum, BYTE* pbBuf, WORD* pwValidNum)
{	
	WORD *pwSub = NULL;
	WORD wSubNum = 0;
	DWORD dwID = 0;
	int i=0, iConfirmNum = 0;
	WORD wValidNum = 0;
	*pwValidNum = 0;
	for (i=0; i<wNum; i++)
	{
		dwID = pProItem[i].dwID;
		pwSub = ProId2SubId(dwID,&wSubNum);

		if(QueryItemTimeMid(dwStartTime, dwEndTime, pProItem[i].wBn, pProItem[i].wPn, pwSub, wSubNum, pbBuf, &wValidNum) == wSubNum)
		{	
			iConfirmNum++;
			*pwValidNum += 1;
		}		
	}

	return iConfirmNum;
}

int QueryItemTimeDwMid(DWORD dwStartTime, DWORD dwEndTime, WORD wBn, WORD wPn, DWORD* pdwID, WORD wNum, BYTE* pbBuf, WORD* pwValidNum)
{
	WORD *pwSub = NULL;
	WORD wSubNum = 0;
	DWORD dwID = 0;
	int i=0, iConfirmNum = 0;
	WORD wValidNum = 0;
	*pwValidNum = 0;
	for (i=0; i<wNum; i++)
	{
		dwID = *pdwID++;
		pwSub = ProId2SubId(dwID,&wSubNum);

		if(QueryItemTimeMid(dwStartTime,dwEndTime,wBn,wPn,pwSub,wSubNum,pbBuf, &wValidNum) == wSubNum)
		{	
			iConfirmNum++;
			*pwValidNum += 1;
		}		
	}

	return iConfirmNum;
}

int QueryItemTimeDwMt(DWORD* pdwStartTime, DWORD* pdwEndTime, TProItem* pProItem, WORD wNum, BYTE* pbBuf, WORD* pwValidNum)
{
	return QueryItemTimeDwMbi(*pdwStartTime,*pdwEndTime, pProItem, wNum, pbBuf, pwValidNum);
}


bool GetProIdInfo(DWORD dwId, TProIdInfo* pInfo, bool fBlk)
{
	const TProId2Sub *pProId2Sub = NULL;
//	TProId2Sub *blkProId = NULL;
//	DWORD dwParentId = 0;
//	DWORD dwMask = 0;
//	DWORD dwOffset = 0;
	bool fFind = false;
//	bool fSubId = false;
//	DWORD dwMaskId = 0;
	BYTE *pbSubId = NULL;
	BYTE *pbBlkId = NULL;
	int i=0;

	memset(pInfo,0,sizeof(TProIdInfo));

	pProId2Sub = BinarySearchProId(dwId);

	if(pProId2Sub != NULL)
	{
		if(pProId2Sub->dwID == dwId)
		{
			//dwId在映射表中存在
			fFind = true;
			pInfo->dwId = dwId;
			pInfo->bIdType = pProId2Sub->wIdType;
			pInfo->wDataLen = GetExistItemsLenDw(&dwId,1) > 0 ? GetExistItemsLenDw(&dwId,1) : 0;
			pInfo->bIdx = 0;
			pInfo->wOffset = 0;
			pInfo->dwProId = pInfo->dwId;
			pInfo->wProLen = pInfo->wDataLen;
			pInfo->bCode = pProId2Sub->bCode;

			if(fBlk && pProId2Sub->dwBlkID != 0)
			{
				fFind = false;
				pProId2Sub = BinarySearchProId(pProId2Sub->dwBlkID);
			}

			if(fFind)
				return fFind;
		}

		if(!fFind && pProId2Sub!=NULL)
		{
			fFind = true;
			//dwId在映射表中不存在,只有对应的块id
			//从块id中取dwId的信息
			pInfo->dwId = dwId;
			pInfo->bIdType = 0;

			//下面这些参数是要计算的。
			pInfo->dwProId = pProId2Sub->dwID;
			//取出块id的数据内容长度
			pInfo->wProLen = GetExistItemsLenDw(&pProId2Sub->dwID,1) > 0 ? GetExistItemsLenDw(&pProId2Sub->dwID,1) : 0;
			pInfo->bCode = pProId2Sub->bCode;
			
			//dwId数据内容长度根据块id的长度除子id个数来求出长度
			if(pProId2Sub->bCode == C_01R) //块id中带费率数
			{
				pInfo->wDataLen = (pInfo->wProLen - 1)/pProId2Sub->bSubNum;

			}
			else
			{
				pInfo->wDataLen = pInfo->wProLen/pProId2Sub->bSubNum;
			}
			//取出单id在块id中的偏移
			pbSubId = (BYTE*)&dwId;
			pbBlkId = (BYTE*)&pProId2Sub->dwID;
			for(i = 0; i < 4; i++)
			{
				if(*pbSubId != *pbBlkId)
				{
					pInfo->bIdx = *pbSubId;
					break;
				}
				pbSubId++;
				pbBlkId++;
			}
			if(pProId2Sub->bCode == C_02)
			{
				//谐波的第二个子ID的最低位从02开始
				if(pInfo->bIdx >= 2)
					pInfo->bIdx -= 1;
			}
			else if(pProId2Sub->bCode == C_03)
			{
				//当前数据中中的 本日 电压偏差最大值、最小值、平均值
				if(pInfo->bIdx >= 1)
					pInfo->bIdx -= 1;
			}

			if(pInfo->bIdx >= 0 && pInfo->bIdx < pProId2Sub->bSubNum)   //pInfo->bIdx >= 0???
			{
				pInfo->wOffset = pInfo->bIdx*pInfo->wDataLen;
				if(pProId2Sub->bCode == C_01R)
					pInfo->wOffset += 1;
			}
			else
			{
				//超出目前所支持的单id个数, 如费率数目前只支持4费率，
				pInfo->bIdx = INVALID_DATA;
				pInfo->wOffset = 0xFFFF;

			}
		}

	}
		
	return fFind;
}

WORD GetOnePnFromDA(BYTE bDA,BYTE bDAG)
{	
	BYTE i;
	WORD wPn;

	if (!bDA || !bDAG)
	{
		wPn = 0;
	}
	else
	{
		WORD startpn = (bDAG<<3) - 7;

		for (i=0; i < 8; i++,bDA>>=1)
		{
			if (bDA & 1)
			{
				wPn = startpn + i;
				break;
			}
		}
	}

	return wPn;
}